{
  "title": "Captain Tony's Saloon: Key West's Most Haunted Bar",
  "slug": "captain-tonys-saloon-key-west-haunted",
  "id": 46102,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/captain-tonys-saloon-key-west-haunted/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-18 12:00:00",
  "wordCount": 1524,
  "readingTime": 6,
  "content": "<p>The building at 428 Greene Street in Key West has housed the island's most disturbing secrets across 175 years. Built in 1851, it served sequentially as an ice house, the city morgue, a wireless telegraph station, a cigar factory, a speakeasy during Prohibition, a bordello, and finally as a saloon. There are bodies beneath the floor. A large tree grows through the center of the bar, its branches reaching through the roof. Seventeen people were hanged from that tree. This is <a href=\"/key-west-ghost-tours/\">Key West's most thoroughly haunted establishment</a>, and its paranormal activity remains consistent across decades of documented accounts.</p>\n\n<h2>The Early Years: Ice House and Infrastructure</h2>\n<p>When the structure was completed in 1851, Key West was a thriving maritime hub and the wealthiest city per capita in the United States. Ships arriving from northern ports carried ice harvested from frozen lakes during winter months. This ice was essential for food preservation in the tropical climate, and 428 Greene Street was constructed specifically to store these shipments. The building's thick walls and design made it the coldest structure on the island, a thermal distinction that would determine its future purposes.</p>\n<p>In the 1890s, the building's significance expanded beyond preservation when it became the location of a wireless telegraph station. On February 15, 1898, news of the USS Maine explosion in Havana was transmitted from this very room. The USS Maine carried 266 American sailors and officers, and their deaths would eventually trigger the Spanish-American War. Key West, positioned just 90 miles from Cuba, became a military and communications hub during the conflict. Operators working in this building transmitted critical intelligence about naval movements, casualty counts, and strategic assessments. The weight of that moment—the moment when an empire's trajectory shifted—haunts the space differently than ghosts do: through historical significance.</p>\n\n<h2>The Morgue Years and the 1865 Hurricane</h2>\n<p>After the Civil War, when yellow fever epidemics and maritime accidents claimed lives faster than the island's cemetery could accommodate them, the city morgue relocated to 428 Greene Street. The building's isolation from residential areas and its proven ability to maintain cold temperatures made it ideal for storing remains. Bodies awaiting autopsy, identification, or burial shared the cold stone chambers with blocks of ice and preserved fish.</p>\n<p>In September 1865, a catastrophic hurricane struck the Keys with devastating force. Storm surge and floodwaters swept through the morgue building, destroying its structure and scattering the remains of deceased residents across the island. Bodies recovered in the debris were sometimes reburied hastily, in mass graves, or beneath new structures being built as the city rebuilt itself. One body was never retrieved. It remained inside the destroyed building and was deliberately sealed beneath a new floor, entombed where the poolroom now stands. For more than a century, nobody knew if this burial was respectful or expedient.</p>\n<p>The mystery deepened in the 1980s when the bar underwent significant renovations. Workers removing floorboards discovered skeletal remains of between 15 and 18 people scattered across the floor. Grave markers emerged from beneath decades of accumulated flooring. One headstone bore the name Elvira, a young woman whose identity was otherwise lost. Her grave marker was cleaned, placed in protective cement next to a pool table, and left exposed. It remains there today, one of only two grave markers visible on the bar floor—a deliberate memorial to the forgotten dead beneath the building.</p>\n\n<h2>The Hanging Tree and Execution History</h2>\n<p>A large tree grows through the center of the bar, its trunk rising from the ground and its branches extending through a hole deliberately cut in the roof. The tree is estimated to be several hundred years old, having grown on this site long before European settlement. During Key West's frontier period—when piracy, wrecking, and smuggling defined the economy—this tree served as an execution site.</p>\n<p>Historical records and local accounts consistently document that 17 people were hanged from this tree's branches: 16 pirates and one woman. The distinction between judicial execution and vigilante justice remains unclear; Key West in the 1800s operated in a legal gray zone where formal law enforcement and mob justice often merged.</p>\n<p>The woman, known in local folklore as the Lady in Blue, committed a crime so severe it warranted death by hanging. She had stabbed her husband to death. She had stabbed her two children to death. She was captured, tried, and condemned to die. When the sentence was carried out beneath the tree's branches, the execution went catastrophically wrong. She did not die quickly. Instead, she hung for two days, slowly suffocating, her face darkening to the same shade of blue as the dress she wore at her execution. Witnesses reported that her suffering was prolonged and terrible, that her body remained visible for an extended period as a warning to others, and that the image of the blue-faced woman hanging before her own corpse became part of the island's collective nightmare.</p>\n<p>The Lady in Blue remains the most frequently encountered apparition at Captain Tony's Saloon. Patrons and staff report seeing flashes of blue light near the women's restroom. Some describe a cold presence moving through the bar, leaving a trail of dropped temperature. Others have felt the sensation of fingers brushing their arms or shoulders—always described as cold to the point of pain, always fleeting, always leaving the witness shaken.</p>\n\n<h2>The Original Sloppy Joe's and the Hemingway Connection</h2>\n<p>After Prohibition ended in 1933, Joe Russell opened a bar in this building. Russell, known affectionately as \"Josie,\" created Sloppy Joe's—a saloon that would become legendary for its association with Ernest Hemingway. The writer, residing in Key West during the 1930s, became a fixture at the Greene Street location. Hemingway drank here regularly, often beginning his evening at Sloppy Joe's and continuing to other bars as the night progressed. He was not the polite, quiet drinker; he was boisterous, prone to arguments, and surrounded by a coterie of writers, fishermen, and local characters.</p>\n<p>In 1937, Hemingway was still a regular when Joe Russell made a dramatic decision. According to local legend, Russell's landlord demanded a rent increase of one dollar per week. Russell refused to negotiate. Instead, he organized a midnight move of the entire bar. He dismantled the bar itself, the fixtures, the furniture, and the liquor inventory. He and his workers carried everything down Greene Street to the current location on Duval Street, establishing the Sloppy Joe's that operates there today. The move happened so quickly and so thoroughly that by morning, nothing remained but empty space. Whether Russell truly moved \"overnight\" or the legend has compressed the timeline, the result was definitive: Sloppy Joe's left, and the Greene Street location passed through a series of owners.</p>\n\n<h2>Captain Tony Tarracino: Mayor, Smuggler, and Visionary</h2>\n<p>Tony Tarracino purchased the bar in 1958, and the building transformed under his ownership. Tarracino was not a conventional businessman. He was a charter boat captain who knew every current, reef, and shallow in the waters around Key West. He was a gambler with a gift for card games and an appetite for risk. He was a smuggler who ran guns to Cuba and moved contraband through the island's ports. He was the kind of man who accumulated stories the way normal people accumulated wealth.</p>\n<p>Under his stewardship, the bar became a gathering place for writers, fishermen, merchants, tourists, and people fleeing trouble elsewhere. Tarracino did not sanitize the building's history; he integrated it into the bar's identity. The graves were left exposed, the tree was preserved, the stories were told and retold until they became part of the island's mythology.</p>\n<p>In 1989, Tarracino was elected mayor of Key West. He served two terms until 1991, governing with the same unpredictable creativity he brought to the bar. He died in 2008, and the building retained his name and his freewheeling spirit. Captain Tony's Saloon remains one of the few establishments in Key West that makes no effort to hide its haunted history; it embraces it, documents it, and encourages visitors to experience it directly.</p>\n\n<h2>The Grave Markers and Their Stories</h2>\n<p>Two grave markers remain visible on the bar floor, embedded in protective cement. The first belongs to Elvira, recovered during the 1980s renovations. Her headstone provides no biographical information beyond her name. She might have been a morgue worker, a victim of disease, or a casualty of violence. The second marker belongs to Reba I. Sawyer, a Key West resident who lived from 1900 to 1950.</p>\n<p>Reba's story involves a widower's discovery of infidelity. According to local legend, after Reba's death, her husband found love letters hidden in her belongings. The letters detailed affairs conducted at various locations around Key West, including at this very bar. The widower's response was dramatic and final: he traveled to the cemetery, had her tombstone removed, and physically relocated it to the bar. He placed it directly beneath the hanging tree, reportedly declaring that if his wife loved this place more than her marriage, then this place would be her eternal resting ground. Whether the story is precisely true or has gained narrative embellishment over the years, Reba's headstone remains, a monument to infidelity, rage, and the complex feelings the dead leave behind.</p>\n\n<h2>The Paranormal Activity: Documented and Persistent</h2>\n<p>The haunting of Captain Tony's Saloon is not dramatic or staged. Patrons do not report levitating objects or violent poltergeist phenomena. Instead, the activity is subtle, consistent, and often only recognized in hindsight. Cold spots manifest near the hanging tree and near the grave markers, sudden temperature drops that dissipate within seconds. Bottles have been observed sliding on shelves, moving from back to front without visible disturbance, sometimes falling to the floor in sequences that suggest intentional behavior. Unexplained voices are heard after closing time, particularly in the pool room area where Elvira's headstone is embedded.</p>\n<p>Electronic equipment malfunctions with unusual frequency: cash registers freezing, jukebox selections changing without user input, lights flickering in patterns that seem responsive rather than electrical. Staff accounts from different decades and different workers consistently describe the same phenomena in the same locations, suggesting either a genuine haunting or a successfully maintained piece of local folklore.</p>\n<p>The Lady in Blue remains the most frequently reported apparition. Witnesses describe seeing a fleeting blue shape near the restrooms, or feeling a sudden cold presence that seems to follow them through the bar. Some have reported the distinct sensation of being touched by something cold and unseen. Others have experienced momentary visions: a flash of a woman's face, blue and suffocating, visible for only a fraction of a second before vanishing. Whether these experiences are genuine paranormal encounters, psychological responses to the building's history, or something existing between the two categories remains unknowable. The witnesses themselves, speaking years after their experience, remain convinced that they experienced something genuinely anomalous.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/articles/hemingway-house-key-west-ghosts/\">The Hemingway House: Key West's Literary Ghosts</a></li>\n<li><a href=\"/articles/key-west-pirate-history-legends/\">Pirates of Key West: Wreckers, Smugglers, and Legends</a></li>\n<li><a href=\"/articles/key-west-cemetery-ghost-stories/\">Key West Cemetery: Ghost Stories and Buried History</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Captain Tony's Saloon: a former morgue, telegraph station, and execution site with 17 hanged and 15+ bodies buried beneath the floor.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/captain-tonys-saloon-key-west-haunted.webp",
    "altText": "Captain Tony's Saloon: Key West's Most Haunted Bar",
    "width": 800,
    "height": 450
  }
}
