{
  "title": "Captain Tony's Saloon: Key West's Most Haunted Bar",
  "slug": "captain-tonys-saloon-key-west-haunted",
  "id": 46102,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/captain-tonys-saloon-key-west-haunted/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>The building at 428 Greene Street in Key West has been, in chronological order, an ice house, the city morgue, a wireless telegraph station, a cigar factory, a speakeasy, a bordello, and a bar. There are bodies under the floor. There is a hanging tree growing through the roof.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>The Morgue Years</h2>\n<p>Built in 1851, the structure at 428 Greene Street served dual purposes from its earliest days. As an ice house receiving shipments from vessels sailing the Atlantic coast, it was the coldest building on the island. That made it the logical choice for Key West's city morgue. Bodies awaiting burial or autopsy were stored in the same space that kept the island's perishables from spoiling.</p>\n<p>In 1865, a devastating hurricane struck the Keys and destroyed much of the building. Corpses stored in the morgue were swept away by floodwaters. One body remained, and it was buried beneath the building, reportedly enclosed by a wall where the poolroom now stands. During renovations in the 1980s, workers removed floorboards and discovered the skeletal remains of between 15 and 18 additional people. A grave marker for a young woman named Elvira was unearthed and is now exposed in the cement floor next to a pool table.</p>\n\n<h2>The Hanging Tree</h2>\n<p>A large tree grows through the center of the bar, its branches reaching through a hole cut in the roof. According to local history, 17 people were hanged from this tree during Key West's rougher years: 16 pirates and one woman.</p>\n<p>The woman, known as the Lady in Blue, had reportedly stabbed her husband and two children to death. She was hanged from the tree but did not die quickly. Accounts say she hung for two days, slowly suffocating. Her face turned the same shade of blue as her dress. To this day, patrons report seeing flashes of blue light in the women's restroom and near the tree. She is Captain Tony's most frequently reported ghost.</p>\n\n<h2>From Sloppy Joe's to Captain Tony's</h2>\n<p>The building became a bar in the 1930s and served as the original location of Sloppy Joe's, the saloon made famous by Ernest Hemingway. When Sloppy Joe's moved down the block to its current location on Duval Street in 1937, the Greene Street space passed through several owners before Tony Tarracino purchased it in 1958.</p>\n<p>Captain Tony, as he was known, was a larger-than-life figure: a charter boat captain, gambler, smuggler, and eventually the mayor of Key West from 1989 to 1991. He ran the bar until his death in 2008, and the saloon retains his name and his freewheeling spirit.</p>\n\n<h2>Reported Paranormal Activity</h2>\n<p>Staff and patrons report cold spots near the hanging tree and the exposed grave markers. Bottles have been seen moving on shelves. Unexplained voices are heard after closing, particularly in the area near the pool table where Elvira's headstone is embedded in the floor. The Lady in Blue remains the most commonly sighted apparition, usually described as a fleeting blue shape near the restrooms or a cold presence passing through the bar area.</p>\n<p>Another headstone in the bar belongs to Reba I. Sawyer, a Key West resident who lived from 1900 to 1950. According to local legend, her widowed husband discovered love letters between Reba and another man detailing affairs at the bar. He dragged her tombstone from the cemetery and placed it under the hanging tree, reportedly saying, \"This is where she wanted to be, so this is where she will stay.\"</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/articles/key-west-pirate-history-legends/\">Pirates of Key West: Wreckers, Smugglers, and Legends</a></li>\n<li><a href=\"/articles/hemingway-house-key-west-ghosts/\">The Hemingway House: Key West's Literary Ghost</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "The haunted history of Captain Tony's Saloon in Key West—a former morgue, telegraph station, and execution site with bodies still buried beneath the floor.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/captain-tonys-saloon-key-west-haunted.webp",
    "altText": "Captain Tony's Saloon haunted history Key West"
  }
}