{
  "title": "Carl von Cosel and Elena Hoyos: Key West's Most Disturbing True Story",
  "slug": "carl-von-cosel-elena-hoyos-key-west",
  "id": 46101,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/carl-von-cosel-elena-hoyos-key-west/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>In 1930, a German-born radiology technician at Key West's Marine Hospital became obsessed with a young Cuban-American woman dying of tuberculosis. What happened after her death remains one of the most disturbing true stories in American criminal history.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>Carl Tanzler Arrives in Key West</h2>\n<p>Georg Karl Tanzler was born in Dresden, Germany, in 1877. He reinvented himself repeatedly throughout his life, eventually settling on the title Count Carl von Cosel. By 1927, he had abandoned his wife and children in Zephyrhills, Florida, and accepted a position as a radiology technician at the United States Marine Hospital in Key West. He was not a physician, though he allowed many people to believe otherwise.</p>\n<p>Tanzler later claimed that during his childhood in Germany, a dead ancestor named Countess Anna Constantia von Cosel had appeared to him in visions, revealing the face of his destined true love: an exotic, dark-haired woman. Whether this was genuine delusion or retrospective fabrication has never been determined.</p>\n\n<h2>Meeting Elena</h2>\n<p>On April 22, 1930, Maria Elena Milagro de Hoyos was brought to the Marine Hospital by her mother. She was 21 years old, Cuban-American, and beautiful. She was also dying of tuberculosis, which in 1930 Key West was effectively a death sentence. Tanzler, then 53, claimed to recognize her instantly as the woman from his childhood visions.</p>\n<p>He attempted to treat Elena with X-rays, herbal remedies, and equipment he brought to the Hoyos family home. He showered her with jewelry and clothing and reportedly professed his love. No evidence has ever surfaced that Elena reciprocated his feelings. She died on October 25, 1931, at her parents' home.</p>\n\n<h2>The Theft</h2>\n<p>Tanzler paid for Elena's funeral and commissioned an above-ground mausoleum in the Key West Cemetery, to which only he held a key. He visited the tomb almost every night for nearly two years. In April 1933, he removed Elena's body from the mausoleum under cover of darkness, transporting it through the cemetery on a toy wagon to his home on Flagler Avenue.</p>\n<p>Over the next seven years, Tanzler reconstructed and preserved the decomposing corpse. He replaced rotting skin with silk cloth soaked in wax and oils. He fitted glass eyes into empty sockets. He stuffed the body cavity with rags, dressed the remains in a wedding gown, and placed Elena on a canopied bed, where he slept beside her each night. He serenaded the corpse on a small pipe organ.</p>\n\n<h2>Discovery</h2>\n<p>In 1940, Elena's sister Florinda heard rumors and confronted Tanzler at his home. He reportedly showed her the body with pride. Authorities were called, and Tanzler was arrested. A psychiatric evaluation found him legally sane. He was charged with desecrating a grave, but the statute of limitations had expired. He faced no significant legal consequences.</p>\n<p>Elena's remains were put on public display at Dean-Lopez Funeral Home before burial. An estimated 6,800 people viewed the body. She was eventually reburied in an unmarked grave at an undisclosed location in the Key West Cemetery to prevent further interference.</p>\n\n<h2>Aftermath</h2>\n<p>Tanzler left Key West and returned to Zephyrhills, where he wrote an autobiography published in the pulp magazine Fantastic Adventures in 1947. He reportedly constructed a life-sized effigy of Elena and lived with it until his death on July 3, 1952. His body was found on the floor of his home near the effigy.</p>\n<p>The case has inspired books, documentaries, and exhibits. Ben Harrison's Undying Love remains the most thorough account. Fort East Martello Museum in Key West includes information about the case alongside its Robert the Doll exhibit, linking two of the island's most unsettling stories under one Civil War-era roof.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/robert-the-doll-key-west-haunted-history/\">Robert the Doll: The True Story of Key West's Most Haunted Object</a></li>\n<li><a href=\"/articles/fort-east-martello-key-west-haunted/\">Fort East Martello: Key West's Haunted Civil War Fort</a></li>\n<li><a href=\"/articles/key-west-cemetery-ghost-stories/\">Key West Cemetery: 100,000 Burials on 19 Acres</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "The true story of Carl Tanzler, the Key West radiologist who stole a young woman's corpse from her mausoleum and lived with it for seven years.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/carl-von-cosel-elena-hoyos-key-west.webp",
    "altText": "Carl von Cosel and Elena Hoyos: Key West's Most Disturbing True Story",
    "width": 800,
    "height": 450
  }
}