{
  "title": "Chicago's Most Haunted Bars and Taverns",
  "slug": "chicagos-most-haunted-bars",
  "excerpt": "From Prohibition speakeasies to pre-Fire taverns, these are the Chicago bars where the spirits aren't all in bottles.",
  "featuredImage": {
    "sourceUrl": "/images/articles/chicagos-most-haunted-bars.webp",
    "altText": "Chicago's Most Haunted Bars and Taverns"
  },
  "content": "Chicago's bar culture predates Prohibition, survived Prohibition, and emerged from Prohibition with a collection of ghost stories that rival the city's official haunted landmarks. The oldest taverns in the city have been accumulating reports of unusual phenomena for generations—unexplained sounds, moving objects, spectral figures, and the pervasive sense that the after-hours crowd includes patrons who never left.\n\n<a href=\"/chicago-ghost-tours/\">Haunted pub crawls</a> through Chicago combine the city's legendary drinking culture with its supernatural reputation. The best stops are not themed tourist bars but genuine working taverns where the hauntings are incidental to the business—places where the bartender might mention the ghost the same way they'd mention the daily special.\n\n\n\n<h2>The Green Mill Cocktail Lounge</h2>\nThe Green Mill at 4802 North Broadway in Uptown is Chicago's most famous bar, and its history is inseparable from the city's gangster era. Originally opened in 1907 as Pop Morse's Roadhouse, it was renamed the Green Mill Gardens in 1910 and quickly became one of the city's premier entertainment venues.<strong>Al Capone</strong> claimed a regular booth near the back of the house—positioned, characteristically, near a rear exit that connected to the basement tunnels. These tunnels, used for bootlegging and smuggling operations during Prohibition, extend beneath the building and into the surrounding neighborhood. <strong>Jack McGurn</strong> (Capone's primary lieutenant at the Green Mill) controlled the day-to-day operations. The bar's star attraction was crooner and entertainer <strong>Joe E. Lewis</strong>, who was paid an extraordinary $650 per week to perform—an enormous sum during the 1920s equivalent to approximately $11,000 today. When Lewis signed a contract to perform at a rival mob-controlled establishment in late 1927, McGurn's men attacked him on November 27, 1927. They beat Lewis with brutal force and slashed his throat so severely that his tongue was partially severed and his vocal cords permanently damaged. Lewis miraculously survived the attack but could never sing with his original voice quality again. He transitioned to a successful comedy and acting career, becoming famous for his wit and timing, though the incident remained a stark reminder of the violent cost of violating mob control and territorial agreements.\n\nThe Green Mill still operates as a jazz club, its original 1920s interior and mahogany bar largely intact. Staff report regular unexplained phenomena occurring primarily after closing time: glasses that slide across the bar without being touched (sometimes moving in patterns), items in the basement tunnels moving on their own, cold drafts emanating from the tunnel entrances, the sound of piano music heard from outside the building that stops abruptly when staff members enter to investigate, the sound of voices and muffled conversations from the basement when no one is present, and a persistent feeling of being observed in the booth once reserved for Capone. Witnesses describe smelling cigar smoke in areas where no smoking is permitted. Psychic investigators and paranormal researchers have identified multiple resident spirits: a woman with dark hair who reportedly prefers to sit on or near the piano (possibly a performer or entertainer from the Prohibition era), a former male employee with a connection to the basement operations, and a flirtatious former regular who seems to make grand entrances through the front door as if seeking to be noticed and admired by patrons.\n\nThe bar's atmosphere—dim lighting, live jazz, original woodwork—makes it difficult to separate genuine phenomena from the natural effects of an old building with a famous history. This ambiguity is part of the Green Mill's appeal: it is a place where the past is so palpable that the boundary between historical atmosphere and supernatural presence becomes impossible to define.\n\n\n\n<h2>Excalibur</h2>The building at 632 North Dearborn Street was constructed in 1892 as the headquarters of the <strong>Chicago Historical Society</strong>, nearly two decades after the devastating Great Fire of 1871. <strong>Designed by noted architect Henry Ives Cobb</strong> as a Romanesque stone fortress with crenellated towers and heavy masonry, it has survived the years and housed various businesses since the Chicago Historical Society relocated to a new facility in 1932, most notably the Excalibur nightclub (opened 1989). The building's rough-cut stone construction and pre-fire foundations extend below modern street level, creating basement spaces that feel significantly older than the visible four-story structure. Some architectural elements and stonework fragments predate 1871, suggesting reuse of surviving materials from the Great Fire era, which may contribute to the building's purported hauntings.\n\nParanormal reports at Excalibur span decades and multiple incarnations of the business since its opening as a nightclub in 1989. Staff and patrons have described full-bodied apparitions on the upper floors, objects moving without explanation, door handles turning on their own, and anomalous electromagnetic readings during investigation sessions. The ornate dome room on the third floor generates particularly consistent reports of a translucent female figure in period clothing (possibly from the 1870s-1900s era) who appears briefly near the domed ceiling and vanishes.\n\nMultiple paranormal investigation teams have conducted formal investigations at Excalibur over the past two decades, reporting findings that include clear Electronic Voice Phenomena (EVP recordings of disembodied voices speaking in intelligible phrases), significant temperature anomalies (sudden cold spots and thermal fluctuations), and photographic evidence (orbs, mists, and shadowy figures) that they consider substantial. The building's massive stone construction, thick walls, and multi-level layout with interconnected basements create an environment that paranormal investigators describe as unusually electromagnetically active and conducive to spirit manifestation.\n\n<h2>The Red Lion Pub</h2>\n\nThe Red Lion Pub at 2446 North Lincoln Avenue (in the Ravenswood neighborhood near Addison Street) presents an unusual case in Chicago's haunted bar landscape. Unlike the Green Mill or Excalibur, the Red Lion does not have a documented long history or a dramatic origin story preceding its haunted reputation. The pub was opened in 1984 by <strong>John Cordwell</strong>, a British expatriate, in a modest three-story brick building that had previously housed various commercial businesses—a shoe repair shop, laundry service, and storage facilities—with no notable historical records. The structure itself appears to be from the late 19th or early 20th century (likely circa 1890s), but its original architect, construction date, and previous uses are poorly documented in Chicago historical archives.\n\nAlmost immediately after opening, staff and patrons began reporting paranormal phenomena: objects moving on their own (glasses, bottles, bar stools), unexplained sounds and disembodied voices, a persistent cold presence on the second floor (particularly the back stairwell), sudden inexplicable smells (tobacco, cologne, food odors), and a general atmosphere of unease that intensified after closing time. Cordwell himself reportedly experienced multiple phenomena personally and came to believe the building was genuinely haunted, though he was never able to identify a specific historical cause—no documented murder, disaster, or violent death has been recorded in the building's history. The phenomena have remained consistent across forty years of operation (1984–2024), reported by multiple staff members with no apparent incentive to fabricate stories that might discourage customers. This makes the Red Lion's case unique: empirical proof that a haunting does not require a dramatic origin story or historical tragedy to justify its occurrence.\n\nThe Red Lion's case is interesting because it challenges the assumption that hauntings require a dramatic origin story. The building has no documented history of murder, disaster, or violent death. Yet the reports have been consistent across forty years of operation, from staff members with no incentive to invent stories that might discourage customers.\n\n\n\n<h2>Liar's Club</h2>\n\n<strong>Liar's Club</strong> at 1665 West Fullerton (in the Bucktown neighborhood, near Ashland Avenue) has operated as a dive bar since approximately the 1980s, though the building itself is considerably older. Its reputation for hauntings is quieter and less documented than the more famous establishments, but no less persistent and consistent among longtime staff members. Bartenders and regulars report cold spots that appear and disappear without discernible pattern (particularly near the restrooms and stairwell), the sound of footsteps on the upper floors when no one is present, and an occasional spectral figure glimpsed in the mirror behind the bar—a shadowy presence described as appearing like a man in hat and coat from a past era.\n\nThe building's history includes use as a residential dwelling and boarding house, a commercial establishment and small restaurant, and—during Prohibition (1920–1933)—possibly as an unlicensed speakeasy or drinking establishment, though documentation is sparse. The hauntings, such as they are, fit the profile of many Chicago bar ghosts: subtle, consistent across decades, and accepted by staff as an integral part of the building's character rather than as a source of alarm or concern.\n\n<h2>The Old Town Ale House</h2>\n\nThe <strong>Old Town Ale House</strong> at 219 West North Avenue (adjacent to the famous Second City improvisational theater), is one of Chicago's most beloved and legendary dive bars and has been a neighborhood fixture since the 1950s. The walls are densely covered with original paintings and drawings created by owner <strong>Bruce Cameron Elliott</strong>, including stylized nudes, colorful caricatures of Chicago politicians and celebrities, and abstract art pieces—a unique form of visual commentary on Chicago's cultural and political landscape spanning decades. The Ale House is famous for its no-nonsense atmosphere, strong drinks, and eclectic crowd that includes comedians, writers, Second City performers, neighborhood regulars, and tourists seeking authentic Chicago character and history.\n\nReports of unusual phenomena at the Ale House are sporadic but memorable, typically occurring during late-night hours and quiet periods. Staff have described hearing conversations and laughter from empty sections of the bar, feeling distinct taps on the shoulder when no one is standing behind them, seeing brief shadowy apparitions near the back of the establishment (particularly near the restrooms and back entrance), and experiencing cold spots that appear and disappear without discernible pattern. The bar's dim atmospheric lighting, cigarette haze (from patrons and historical smoking), storied history as a legendary gathering place for Chicago's creative community (comedians, writers, performers), and distinctive wall art contribute to an environment where the line between ordinary and extraordinary is pleasantly blurred. Many staff members and longtime patrons suggest the phenomena may be benign residual presences of departed regulars and departed owners—individuals who found the Ale House's welcoming, unpretentious atmosphere and artistic community too meaningful to abandon, even in death.\n\n<h2>Drinking with the Dead</h2>Chicago's haunted bars share a common quality: they are places where the living and the dead (allegedly) coexist without much fuss. The ghosts, if present, are not dramatic or threatening. They are residual presences—remnants of previous occupants or patrons who apparently found the atmosphere agreeable enough to remain.\n\nFor visitors to <a href=\"/articles/most-haunted-places-in-chicago/\">Chicago's haunted landmarks</a>, the city's bars offer an accessible and enjoyable entry point. You don't need to walk through a dark forest or visit a cemetery to encounter Chicago's supernatural side. Sometimes, you just need to find the right barstool and wait.\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/chicago-gangster-ghosts/\">Chicago's Gangster Ghosts</a></li>\n<li><a href=\"/articles/congress-plaza-hotel-haunted-history/\">The Congress Plaza Hotel</a></li>\n<li><a href=\"/articles/most-haunted-places-in-chicago/\">Chicago's Most Haunted Places</a></li>\n<li><a href=\"/chicago-ghost-tours/\">Chicago Ghost Tours Hub</a></li>\n</ul>",
  "id": 60008,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/chicagos-most-haunted-bars/",
  "date": "2026-02-12 12:00:00",
  "modified": "2026-02-25 21:02:02",
  "pageType": "hub-spoke",
  "categories": [
    {
      "id": 600,
      "slug": "chicago-haunted-history",
      "name": "Chicago Haunted History",
      "description": "The dark history behind Chicago's hauntings—from the Great Fire and H.H. Holmes to Resurrection Mary, gangster ghosts, and the city's most haunted landmarks."
    }
  ],
  "wordCount": 1785,
  "readingTime": "7 min read",
  "articleType": "cluster",
  "semanticScores": {
    "entities": 2,
    "years": 12,
    "dataPoints": 21,
    "namedPeople": 32,
    "sourceRefs": 2,
    "h2Breadth": 12,
    "entityDensity": 1.1
  }
}