{
  "title": "Fort East Martello: Key West's Haunted Civil War Fort",
  "slug": "fort-east-martello-key-west-haunted",
  "id": 46105,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/fort-east-martello-key-west-haunted/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>Fort East Martello was built to defend Key West during the Civil War. It never fired a shot in battle. The soldiers who garrisoned it died of disease instead, and the fort's darkest legacy has nothing to do with combat.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>Construction and Purpose</h2>\n<p>Construction of Fort East Martello began in 1862 as part of a network of coastal fortifications designed to protect Key West's harbor during the Civil War. Key West, despite being in Florida, remained under Union control throughout the war. The fort was built in the Martello tower style—circular, thick-walled brick structures designed to withstand naval bombardment. It was never completed, and no enemy forces ever attacked it.</p>\n<p>The soldiers stationed at the fort faced a more insidious enemy than Confederate artillery. Yellow fever, malaria, diphtheria, and other tropical diseases killed garrison troops at alarming rates. The fort's location on the southeastern shore of the island, surrounded by standing water and dense vegetation, made it a breeding ground for the Aedes aegypti mosquitoes that transmitted yellow fever. More soldiers died of disease at Fort East Martello than in any engagement in the Key West theater.</p>\n\n<h2>The Museum</h2>\n<p>After decades of abandonment, the fort was converted into a museum by the Key West Art and Historical Society. It now houses collections of local folk art, military artifacts, and Key West's two most famous exhibits: Robert the Doll and materials related to the Carl von Cosel case. The artist Gene Otto, Robert's original owner, designed the museum's gallery space before his death in 1974.</p>\n<p>USA Today named Fort East Martello one of America's 10 Most Haunted Destinations. The combination of disease-era deaths, the concentrated energy attributed to Robert the Doll, and the fort's atmospheric brick casemates and corridors makes it a focal point for Key West's paranormal tourism industry.</p>\n\n<h2>Reported Activity</h2>\n<p>Museum staff report a pattern of electronic malfunctions near Robert's display case: cameras freeze, phone batteries drain, and recording equipment produces static. Cold spots have been documented in the fort's interior corridors, particularly in areas that served as hospital wards during the Civil War. Visitors describe the sensation of being watched in the upper galleries and hearing footsteps in empty rooms.</p>\n<p>Whether these experiences reflect the fort's documented history of mass death from disease, the influence of Robert the Doll, or the suggestive power of a 160-year-old military ruin, Fort East Martello remains the single most visited haunted location in Key West.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/robert-the-doll-key-west-haunted-history/\">Robert the Doll: The True Story of Key West's Most Haunted Object</a></li>\n<li><a href=\"/articles/key-west-yellow-fever-fort-jefferson/\">Yellow Fever, Fort Jefferson, and the Dry Tortugas</a></li>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "The history of Fort East Martello in Key West—a Civil War fort turned museum that houses Robert the Doll and the remnants of a yellow fever hospital.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/fort-east-martello-key-west-haunted.webp",
    "altText": "Fort East Martello: Key West's Haunted Civil War Fort",
    "width": 800,
    "height": 450
  }
}