{
  "title": "The Hemingway House: Key West's Literary Ghost",
  "slug": "hemingway-house-key-west-ghosts",
  "id": 46108,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/hemingway-house-key-west-ghosts/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-18 12:00:00",
  "content": "<p>Ernest Hemingway wrote some of his most important novels in a second-floor studio overlooking 907 Whitehead Street in Key West. He stood at a round table in that room, working through the mornings, crafting prose that would define twentieth-century American literature. He lived here from 1931 to 1939, then left the island for Cuba and Mexico and Europe. But according to staff members, museum guides, and visitors who have spent time in that studio across the decades, something of Hemingway remained. The sound of typewriter keys still clicks through the empty room. A tall bearded figure still stands at the window. The cats still stare at empty spaces, watching something visitors cannot see.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>, exploring the island's most persistent legends and documented hauntings.</p>\n\n<h2>A House Built on Stone and Salvage</h2>\n\n<p>The house at 907 Whitehead Street was constructed in 1851 by Asa Tift, a wealthy merchant and salvage wrecker who made his fortune raising cargo from shipwrecks—a common profession in Key West during the nineteenth century. Tift designed the residence in Spanish colonial style, a deliberate choice suited to the tropical climate and the island's cultural heritage. The house was built almost entirely from native coral rock quarried directly on the property, using stone that had been exposed as builders cleared the land. Coral construction offered both durability and beauty, its pale cream color and porous texture becoming more distinctive with age and sea salt.</p>\n\n<p>In 1851, this was a radical innovation: the Hemingway House was the first residence in Key West to include indoor plumbing and running water. For a frontier town built on an island surrounded by seawater, access to fresh water was a pressing concern, and Asa Tift's engineering foresight became a point of pride. The house featured a cistern system that collected rainwater, innovative for its time. Nearly a century later, in 1938, Pauline Hemingway commissioned a swimming pool on the grounds—a second luxury that cost $20,000 at the height of the Great Depression. When Ernest jokingly complained about the expense, Pauline had a penny embedded in the concrete pool deck to commemorate his supposedly final, sacrificed cent. Visitors can still see it there today.</p>\n\n<h2>Hemingway's Years of Prolific Work</h2>\n\n<p>Ernest and Pauline Pfeiffer arrived in Key West in April 1931, settling into the Whitehead Street house that would become central to Hemingway's creative life for the next eight years. This period was astonishingly productive. Hemingway completed <em>A Farewell to Arms</em> in Key West, finished his collection of short stories that would appear in <em>Winner Take Nothing</em>, wrote <em>To Have and Have Not</em> and <em>The Snows of Kilimanjaro</em>, published <em>Green Hills of Africa</em>, and drafted substantial sections of <em>For Whom the Bell Tolls</em>. He produced journalism and participated in the literary culture of the 1930s while maintaining a disciplined writing routine that governed his days.</p>\n\n<p>Hemingway's workspace occupied a room above the carriage house, accessible only by a catwalk that extended from the second-floor balcony of the main residence. He wrote in the mornings, usually standing—a habit he maintained throughout his career. The round table where he worked still occupies the studio. He rarely wrote for more than three or four hours, stopping by mid-afternoon to pursue other interests: fishing in the Gulf Stream aboard chartered boats, sparring with local boxers in a ring he installed in the yard, and spending evenings at Sloppy Joe's on Greene Street, drinking and trading stories with writers, fishermen, and hangers-on attracted to his company and his reputation.</p>\n\n<h2>The Literary and Social World of Key West</h2>\n\n<p>Hemingway's social circle in Key West centered on fishing and drinking, two pursuits he pursued with equal dedication. Sloppy Joe Russell, the owner of the eponymous bar on Greene Street, became one of Hemingway's closest friends and frequent companions. Russell owned a charter fishing boat called the <em>Anita</em>, and Hemingway spent countless days on the water pursuing marlin and sailfish, experiences that directly informed his fiction. Charles Thompson, a Key West native and hunting companion, also featured prominently in Hemingway's social life. Josie Russell, Sloppy Joe's brother, worked as a fishing guide and also spent time in Hemingway's circle.</p>\n\n<p>The dynamics of this world shifted dramatically in 1936, when Hemingway met Martha Gellhorn, a young and ambitious journalist, in Sloppy Joe's itself. Their relationship developed over the next three years as his marriage to Pauline deteriorated. The tension grew palpable in Key West, becoming one of the unstated reasons Hemingway spent increasing time away from the house, traveling to Africa, the American West, and eventually Spain to cover the Spanish Civil War. By 1939, his relationship with Key West—and with Pauline—had fractured beyond repair. He left the island in late 1939 for Cuba, never to return as a resident. Pauline remained in the Whitehead Street house, where she lived until her death in 1951, keeping Hemingway's studio largely as he had left it.</p>\n\n<h2>The Polydactyl Dynasty</h2>\n\n<p>The most visible residents of the Hemingway Home today are not the ghosts, but the approximately 60 polydactyl cats that roam the property at will. These cats—distinguished by their extra toes—are descendants of Snow White, a six-toed cat given to Hemingway by a ship captain, likely in the mid-1930s. Hemingway was charmed by the cats and began keeping them as fixtures of the household. After his departure, Pauline maintained the cats, and they have been part of the property's identity ever since.</p>\n\n<p>The cats are protected by a special Key West city ordinance that recognizes them as part of the island's cultural heritage. They receive regular veterinary care and are named after famous people, including actors, musicians, and political figures. Tour groups delight in spotting them sunbathing on porches, perching on walls, or napping on furniture. For many visitors, the cats are the primary draw. Yet regular staff members and guides have noted an odd coincidence: the cats frequently stare fixedly at the second-floor studio and balcony, their attention directed at spaces that appear empty to human observers. Whether the cats sense something that visitors do not, or whether this is simply feline eccentricity, remains open to interpretation.</p>\n\n<h2>The Sounds from the Empty Studio</h2>\n\n<p>The ghost stories associated with the Hemingway House emerge from consistent, independent reports spanning decades. The most frequently documented phenomenon is the sound of typewriter keys clicking in the studio above the carriage house—a sound that occurs when the room is empty, locked, and unoccupied. This report has been made by multiple staff members across different years, with witnesses describing the precise sound of mechanical typewriter keys striking paper, followed by the characteristic sound of the carriage return lever being pulled. No typewriter has been in the studio for many years, yet the sound persists.</p>\n\n<p>Other accounts describe a tall, bearded figure seen in the second-floor rooms and particularly in the studio itself. The figure is typically described as standing at or near the window, or seated at the round writing table, matching the appearance Hemingway maintained during his Key West years. Visitors and staff have reported lights turning on by themselves in the studio, despite the switches being located outside the room. Cold spots have been documented on the second-floor balcony, particularly near the catwalk leading to the studio. The master bedroom has been noted as a location where visitors report an unexplained sense of presence, a feeling of being watched or observed by something unseen.</p>\n\n<h2>Pauline's House, Hemingway's Ghost</h2>\n\n<p>The historical irony is sharp: Hemingway left Key West in 1939, abandoning the house and his marriage to Pauline in pursuit of Martha Gellhorn and new literary challenges. Pauline kept the house, maintained it, and lived there until her death in 1951. It was Pauline who preserved Hemingway's studio essentially unchanged, keeping his round table, his writing implements, and the physical space much as he had left it. The house was converted to a museum in 1964, after Pauline's death and after Hemingway's own death in 1961. Today it operates as a museum dedicated to his life and work, open daily to visitors.</p>\n\n<p>The reported phenomena—the typewriter sounds, the figure in the studio, the lights, the cold spots—began appearing in staff accounts after the museum opened, though some employees report experiences suggesting earlier manifestations. These stories have accumulated slowly, reported by individuals who have no incentive to fabricate them and often with initial skepticism. Whether one attributes these phenomena to Hemingway's lingering presence, to the power of suggestion and literary mythology, to acoustic properties of the old house, or to coincidence and misinterpretation, the consistency of reports across independent observers and years suggests something warrants serious attention. At minimum, the house itself possesses a palpable atmosphere that visitors frequently remark upon—a sense of presence that seems to emanate from the second-floor studio where, nine decades ago, a man stood at a round table and wrote the future.</p>\n\n<h2>Visiting the Hemingway Home Today</h2>\n\n<p>The Ernest Hemingway Home and Museum operates daily at 907 Whitehead Street, welcoming visitors to tour the residence, view exhibits on Hemingway's life and work, and encounter the famous polydactyl cats. Guided tours cover the history of the house and its construction, Hemingway's years in Key West and his literary output during that period, his personal relationships and social world, the role of fishing in his life, and the museum's preservation of his workspace. The second-floor studio remains the focal point of most visits—the round table draws visitors' attention immediately, and many pause there for longer than they initially planned.</p>\n\n<p>Those who work at the museum regularly encounter visitors asking about the ghost stories, about the sounds in the studio, about the presence that many report feeling in that room. The museum itself neither confirms nor denies the phenomena, presenting them as accounts that visitors are welcome to experience for themselves. Whether you encounter Hemingway's ghost in that studio, or only the atmosphere of a place where tremendous creative work once occurred, a visit to the second-floor workspace offers a tangible connection to one of literature's most significant figures and to a moment in Key West's history when intellectual and creative energy flourished alongside the island's maritime culture.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/captain-tonys-saloon-key-west-haunted/\">Captain Tony's Saloon: Key West's Most Haunted Bar</a></li>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/articles/key-west-pirate-history-legends/\">Pirates of Key West: Wreckers, Smugglers, and Legends</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "wordCount": 1542,
  "readingTime": 6,
  "excerpt": "Ernest Hemingway's Key West studio still echoes with typewriter sounds. Staff and visitors report seeing his figure at the window.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/hemingway-house-key-west-ghosts.webp",
    "altText": "The Hemingway House: Key West's Literary Ghost",
    "width": 800,
    "height": 450
  }
}
