{
  "title": "The Hemingway House: Key West's Literary Ghost",
  "slug": "hemingway-house-key-west-ghosts",
  "id": 46108,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/hemingway-house-key-west-ghosts/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>Ernest Hemingway wrote some of his most important works in a second-floor studio at 907 Whitehead Street in Key West. He left the island in 1939. According to those who work there, parts of him stayed.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>Hemingway in Key West</h2>\n<p>Hemingway and his second wife, Pauline Pfeiffer, moved into the Spanish colonial-style house on Whitehead Street in 1931. The house, built in 1851 from native rock quarried on the property, was among the first in Key West to have indoor plumbing and a swimming pool. Hemingway wrote A Farewell to Arms, To Have and Have Not, The Snows of Kilimanjaro, and parts of For Whom the Bell Tolls during his years on the island.</p>\n<p>His writing studio occupied a room above the carriage house, accessible by a catwalk from the main house's second-floor balcony. He wrote in the mornings, standing at a round table, and spent afternoons fishing, drinking at Sloppy Joe's on Greene Street, and socializing with a circle that included other writers, fishermen, and drifters.</p>\n\n<h2>The Cats</h2>\n<p>The Hemingway Home is famous for its population of approximately 60 polydactyl cats—cats with extra toes. They are descendants of a six-toed cat named Snow White, given to Hemingway by a ship captain. The cats roam the property freely, sleeping on furniture, perching on walls, and generally treating the museum as their personal estate. They are protected by a special city ordinance.</p>\n\n<h2>The Ghost</h2>\n<p>Staff members and visitors have reported seeing a figure resembling Hemingway in the second-floor rooms and in the writing studio above the carriage house. The figure is typically described as a tall, bearded man standing at a window or sitting at the writing desk. The sound of typewriter keys clicking has been heard from the empty studio on multiple occasions, reported independently by different staff members across different years.</p>\n<p>Other reports include lights turning on by themselves in the studio, cold spots on the second-floor balcony, and the sense of a presence in the master bedroom. Tour guides note that the cats sometimes stare fixedly at empty spaces as though watching something invisible to human observers. Whether this reflects feline eccentricity or something else is left to the visitor's interpretation.</p>\n\n<h2>Visiting</h2>\n<p>The Ernest Hemingway Home and Museum at 907 Whitehead Street is open daily. Guided tours cover Hemingway's life in Key West, his writing process, and the history of the house. The polydactyl cats are the main attraction for many visitors, but those who pay attention to the second-floor studio may notice why some people believe the house's most famous resident is still at work.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/captain-tonys-saloon-key-west-haunted/\">Captain Tony's Saloon: Key West's Most Haunted Bar</a></li>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/articles/key-west-pirate-history-legends/\">Pirates of Key West: Wreckers, Smugglers, and Legends</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Ernest Hemingway lived at 907 Whitehead Street in Key West from 1931 to 1939. Staff and visitors say he never left. The ghost stories of the Hemingway Home.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/hemingway-house-key-west-ghosts.webp",
    "altText": "The Hemingway House: Key West's Literary Ghost",
    "width": 800,
    "height": 450
  }
}