{
  "title": "Pirates of Key West: Wreckers, Smugglers, and Legends",
  "slug": "key-west-pirate-history-legends",
  "id": 46107,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/key-west-pirate-history-legends/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>The line between wrecking and piracy in Key West was never as clear as the federal court wanted it to be. For much of the 19th century, the island operated in a gray zone where salvage, smuggling, and outright theft overlapped.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>The Golden Age of Piracy in the Keys</h2>\n<p>The Florida Keys sat at the intersection of the richest shipping lanes in the Americas. Spanish treasure fleets carrying gold and silver from Mexico and South America passed through the Straits of Florida, making the Keys a natural hunting ground for pirates from the 1600s through the early 1800s. Black Caesar, a legendary pirate said to have been a formerly enslaved African, reportedly operated near the Keys, using the mangrove islands as hideouts.</p>\n<p>By the 1820s, piracy had become such a problem that the U.S. Navy established a base in Key West specifically to combat it. Commodore David Porter's Anti-Piracy Squadron, also known as the Mosquito Fleet, operated from Key West beginning in 1823. The campaign was largely successful in suppressing organized piracy, but small-scale smuggling and maritime lawlessness continued for decades.</p>\n\n<h2>Wreckers or Pirates?</h2>\n<p>The wrecking industry that made Key West wealthy was supposed to be legitimate. A federal wrecking court regulated salvage operations, and wreckers needed licenses. But the temptations were obvious. When legitimate wrecks didn't produce enough revenue, some wreckers were accused of moving channel markers, extinguishing lighthouse lamps, or displaying false lights to lure ships onto the reef. The federal court investigated these claims periodically, but convictions were rare in a town where the judge, the wreckers, and the auctioneers all drank at the same establishments.</p>\n\n<h2>The Hanging Tree</h2>\n<p>Sixteen pirates and one murderer were reportedly hanged from the tree that now grows through the center of Captain Tony's Saloon at 428 Greene Street. The executions predate the building's construction, suggesting the tree served as an informal gallows during Key West's rougher years. Whether all 17 hangings were judicial or some were vigilante justice is unclear. The tree remains the most visible physical link to Key West's pirate-era violence.</p>\n\n<h2>Jean Lafitte and Hidden Treasure</h2>\n<p>Jean Lafitte, the French pirate and privateer who operated in the Gulf of Mexico in the early 1800s, is rumored to have cached treasure in the Florida Keys. No verified Lafitte treasure has ever been recovered from Key West, but the legend persists. Lafitte's confirmed base of operations was in Barataria Bay, Louisiana, and later Galveston, Texas, but his ships ranged widely, and the Keys were a logical waypoint. The legend adds another layer to Key West's identity as a place where fortunes were made, hidden, and lost.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/key-west-shipwrecks-wreckers-history/\">Key West Shipwrecks and the Wrecking Industry That Built Bone Island</a></li>\n<li><a href=\"/articles/captain-tonys-saloon-key-west-haunted/\">Captain Tony's Saloon: Key West's Most Haunted Bar</a></li>\n<li><a href=\"/articles/jean-lafitte-pirate-ghost-of-new-orleans/\">Jean Lafitte: The Pirate Ghost of New Orleans</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Key West's pirate history—from the hanging tree at Captain Tony's to Jean Lafitte's rumored treasure and the thin line between wrecking and piracy.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/key-west-pirate-history-legends.webp",
    "altText": "Pirates of Key West: Wreckers, Smugglers, and Legends",
    "width": 800,
    "height": 450
  }
}