{
  "title": "Yellow Fever, Fort Jefferson, and the Dry Tortugas",
  "slug": "key-west-yellow-fever-fort-jefferson",
  "id": 46109,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/key-west-yellow-fever-fort-jefferson/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>Fort Jefferson sits on Garden Key in the Dry Tortugas, 70 miles west of Key West. It is the largest masonry structure in the Americas. It was also a death trap, where yellow fever killed soldiers and prisoners faster than any enemy could.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>Building Fort Jefferson</h2>\n<p>Construction began in 1846 on an ambitious hexagonal fort designed to control shipping lanes through the Gulf of Mexico. The fort's walls are 8 feet thick and 45 feet high, with gun emplacements for 450 cannons. It was never completed, and it never fired a shot in anger. The project was plagued by supply shortages, engineering challenges, and the disease that would define the fort's legacy.</p>\n<p>During the Civil War, Fort Jefferson served as a Union military prison. Its most famous inmate was Dr. Samuel Mudd, the physician convicted of conspiracy in Abraham Lincoln's assassination for treating John Wilkes Booth's broken leg during Booth's escape. Mudd was sentenced to life imprisonment and transferred to Fort Jefferson in 1865.</p>\n\n<h2>Yellow Fever</h2>\n<p>Yellow fever arrived at Fort Jefferson repeatedly. The 1867 outbreak was the worst, killing 38 of the roughly 270 people on the island. The disease—transmitted by Aedes aegypti mosquitoes, though this was not understood at the time—produced high fever, jaundice, and hemorrhagic bleeding. Patients vomited black bile as their organs failed. There was no treatment.</p>\n<p>Dr. Mudd, despite being a prisoner, volunteered to treat the sick when the fort's physician died of the disease. His work during the epidemic was credited with saving lives and eventually contributed to his pardon by President Andrew Johnson in 1869. The irony of a man imprisoned for conspiracy in one death earning his freedom by preventing others was not lost on contemporaries.</p>\n\n<h2>The Submerged Cemetery</h2>\n<p>In August 2022, divers from the University of Miami discovered the submerged remains of a 19th-century quarantine hospital and cemetery near the Dry Tortugas. The site, on a now-submerged island, had served as an isolation facility for yellow fever patients. Among the finds was a headstone inscribed \"JOHN GREER. Nov. 5. 1861.\" The discovery confirmed what historians had long suspected: the death toll from yellow fever in the Keys was greater than official records indicated, with some victims buried in locations that the rising sea has since reclaimed.</p>\n\n<h2>Yellow Fever in Key West</h2>\n<p>Key West itself suffered multiple yellow fever outbreaks. Major epidemics struck in 1853, 1862, and 1867, with smaller outbreaks continuing into the 1890s. Fort East Martello, built on Key West's shore, doubled as a fever hospital where soldiers died from disease rather than combat. The <a href=\"/articles/fort-zachary-taylor-key-west-haunted/\">Fort Zachary Taylor</a> area also has strong ties to Civil War-era military occupation and disease. The Key West Cemetery's rapid expansion during these decades—eventually reaching an estimated 100,000 burials on 19 acres—reflects the cumulative toll of tropical disease on the island's population.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/key-west-cemetery-ghost-stories/\">Key West Cemetery: 100,000 Burials on 19 Acres</a></li>\n<li><a href=\"/articles/fort-east-martello-key-west-haunted/\">Fort East Martello: Key West's Haunted Civil War Fort</a></li>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Yellow fever killed more soldiers in the Florida Keys than any battle. The story of Fort Jefferson, the Dry Tortugas quarantine hospital, and the submerged...",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/key-west-yellow-fever-fort-jefferson.webp",
    "altText": "Yellow Fever, Fort Jefferson, and the Dry Tortugas",
    "width": 800,
    "height": 450
  }
}
