{
  "title": "Key West Cemetery: 100,000 Burials on 19 Acres",
  "slug": "key-west-cemetery-ghost-stories",
  "id": 46103,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/key-west-cemetery-ghost-stories/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>The Key West Cemetery holds an estimated 100,000 burials on just 19 acres. The island's living population is roughly 25,000. The dead outnumber the living four to one.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>Why the Cemetery Moved</h2>\n<p>The original Key West burial ground sat near the waterfront. In 1846, a major hurricane struck the island and dislodged coffins from the sandy soil, washing them into the streets and harbor. The sight of caskets floating through town was traumatic enough to prompt the city to relocate its dead to higher ground. The new cemetery was established in 1847 on Solares Hill, the highest natural point on the island at 18 feet above sea level.</p>\n<p>The coral rock foundation and high water table made traditional below-ground burial nearly impossible. Most graves are above-ground vaults, stacked tombs, and wall crypts, giving the cemetery a visual similarity to the famous cemeteries of New Orleans. The cemetery remains active, with approximately 100 burials per year.</p>\n\n<h2>Sections and Stories</h2>\n<p>The cemetery is divided by heritage and faith: Cuban, Bahamian, Catholic, Jewish, and military sections reflect the waves of immigration that built Key West. A dedicated section honors the 253 sailors who died when the USS Maine exploded in Havana Harbor in 1898, an event that helped trigger the Spanish-American War. The news of the Maine's destruction was transmitted to the world from the very building that is now Captain Tony's Saloon.</p>\n<p>One gravestone has become a tourist attraction in its own right. It reads: \"I Told You I Was Sick.\" Another, belonging to a widow, reads: \"At Least I Know Where He's Sleeping Tonight.\" These darkly humorous epitaphs reflect Key West's irreverent character, but the cemetery's history is anything but lighthearted.</p>\n\n<h2>Yellow Fever and the Death Count</h2>\n<p>Yellow fever struck Key West repeatedly throughout the 19th century. Major outbreaks in 1853, 1862, and 1867 killed hundreds, with smaller outbreaks continuing into the 1890s. The disease was transmitted by Aedes aegypti mosquitoes, but this was not understood until the early 1900s. Victims suffered high fever, jaundice, and hemorrhaging, often dying within days.</p>\n<p>Fort Jefferson in the Dry Tortugas, 70 miles west of Key West, operated a quarantine hospital where infected soldiers and prisoners were isolated. Many died there. In 2022, divers discovered the submerged remains of a 19th-century quarantine cemetery near the fort, including a headstone inscribed \"JOHN GREER. Nov. 5. 1861.\"</p>\n\n<h2>The Bahamian Guardian</h2>\n<p>The most commonly reported ghost in the Key West Cemetery is a figure known as the Bahamian Guardian. Described as a tall woman in period dress, she is said to confront visitors who sit on graves, lean against tombs, or otherwise disrespect the dead. Witnesses report being approached by the figure, feeling a sudden chill, and then finding no one there when they turn around.</p>\n<p>The Bahamian section of the cemetery is among the oldest, reflecting the deep ties between Key West and the Bahamas dating to the wrecking era. Many of Key West's original settlers were Bahamian, and their descendants maintain the section. The Guardian, whoever she was in life, appears to take her custodial role seriously.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/carl-von-cosel-elena-hoyos-key-west/\">Carl von Cosel and Elena Hoyos: Key West's Most Disturbing True Story</a></li>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/articles/key-west-yellow-fever-fort-jefferson/\">Yellow Fever, Fort Jefferson, and the Dry Tortugas</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "The Key West Cemetery holds more dead than the island has living residents. Explore its above-ground vaults, yellow fever victims, and the Bahamian Guardian ghost.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/key-west-cemetery-ghost-stories.webp",
    "altText": "Key West Cemetery: 100,000 Burials on 19 Acres",
    "width": 800,
    "height": 450
  }
}