{
  "title": "Yellow Fever, Fort Jefferson, and the Dry Tortugas",
  "slug": "key-west-yellow-fever-fort-jefferson",
  "id": 46109,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/key-west-yellow-fever-fort-jefferson/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-25 20:55:43",
  "wordCount": 1768,
  "readingTime": "7 min read",
  "content": "<p>Fort Jefferson sits on Garden Key in the Dry Tortugas, 70 miles west of Key West. It is the largest masonry structure in the Americas, a hexagonal fortress of 8-foot-thick walls rising 45 feet from the Caribbean, built to command the shipping lanes of the Gulf of Mexico. Yet no enemy cannon ever fired upon it. Instead, a far more lethal killer claimed hundreds of lives on this remote coral island: yellow fever.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>The Disease: Yellow Fever's Anatomy of Horror</h2>\n<p>Yellow fever is not dramatic in its initial presentation. A victim wakes with sudden onset high fever, muscular pain, and malaise. The body temperature spikes to 104 degrees Fahrenheit or higher, sometimes reaching 105-106 degrees. For two to three days, the sufferer experiences relentless muscle aches, headaches, and weakness. Many recover at this point, believing they have weathered some ordinary tropical illness.</p>\n<p>But in 20 to 50 percent of cases, the disease enters its hemorrhagic phase. Jaundice sets in—the characteristic yellowing of the skin and whites of the eyes that gave the disease its name. The liver and kidneys begin to fail. Hemorrhaging starts internally and externally: blood seeps from the gums, the eyes, the intestines. Vomit turns black with digested blood—the dreaded <i>vómito negro</i> that physicians had observed for centuries but could not explain or stop. Death follows within days, often preceded by delirium and organ collapse.</p>\n<p>The cause of yellow fever would remain a mystery until Dr. Walter Reed and his research team, including Dr. James Carroll and Dr. Aristides Agramonte, proved in Cuba in 1900 that the Aedes aegypti mosquito transmitted the virus. For the entire 19th century—throughout the epidemics of the Florida Keys—physicians blamed foul air, bad humors, miasma, or moral failings. They bled patients, administered quinine, and isolated the sick. None of it worked. Until the mosquito was identified and controlled, yellow fever remained essentially untreatable and inevitable wherever the tropical mosquito thrived.</p>\n\n<h2>Building Fort Jefferson: Ambition on an Island</h2>\n<p>Construction of Fort Jefferson began in 1846 under the direction of Captain Robert E. Lee, then an Army engineer. The hexagonal design was ambitious: a hexagonal masonry fort capable of mounting 450 cannon, intended to defend American interests in the Gulf of Mexico and guard against piracy and foreign incursion. The location—Garden Key in the Dry Tortugas, a cluster of small islands 70 miles west of Key West—was deliberately remote: difficult to approach, easy to defend.</p>\n<p>The logistics were staggering. Every building material, every tool, every ounce of food and water had to be shipped by boat across open water. The fort was constructed by enslaved workers and immigrant laborers, many of whom died from disease before a single wall reached its intended height. The work was punishing: digging, hauling, laying brick under the tropical sun, exposed to the salt air and the relentless insect swarms that plagued the island.</p>\n<p>The fort's walls are 8 feet thick and rise 45 feet high—thick enough to withstand cannon bombardment, though such bombardment never came. Construction continued sporadically through the Civil War and beyond, but the fort was never completed. The hexagonal structure remains, its empty gun emplacements facing a sea that never brought the invasion they were meant to repel. Instead, the fort's role shifted: it became a symbol not of military strength, but of confinement, disease, and the helplessness of 19th-century medicine.</p>\n\n<h2>Civil War Prison and Dr. Samuel Mudd</h2>\n<p>During the American Civil War, Fort Jefferson was converted into a Union military prison. Its remoteness—70 miles from Key West, accessible only by boat—made it an ideal place to hold prisoners with minimal chance of escape. Conditions were harsh: extreme heat, isolation, limited fresh water (the fort relied on cistern collection during rainfall), and the ever-present threat of tropical disease.</p>\n<p>Among the prisoners transferred to Fort Jefferson in 1865 was Dr. Samuel Mudd. Mudd was a Maryland physician convicted of conspiracy in the assassination of President Abraham Lincoln. His crime: he had treated John Wilkes Booth's broken leg immediately after the assassination, not knowing—or so he claimed—that the man he was treating was the assassin. Despite his protests of innocence, Mudd was convicted and sentenced to life imprisonment. He was sent to Fort Jefferson in May 1865.</p>\n<p>Mudd's imprisonment was the beginning of a trajectory that would lead to his redemption and his pardon, but only through suffering and the epidemic that would consume the fort in the summer of 1867.</p>\n\n<h2>The 1867 Yellow Fever Epidemic: Death on Garden Key</h2>\n<p>In the summer of 1867, yellow fever struck Fort Jefferson with devastating force. Of approximately 270 people on the island—soldiers, officers, and prisoners—38 died. The epidemic was sudden and relentless. The fort's surgeon, Dr. Joseph Sim Smith, contracted the disease early in the outbreak and died. Other officers and enlisted men fell rapidly. There was no isolation, no understanding of how the disease spread, no way to prevent infection.</p>\n<p>As the epidemic deepened and the fort's medical capacity collapsed, an extraordinary thing happened: Dr. Samuel Mudd, a prisoner, volunteered to treat the sick. Despite being incarcerated, despite his life sentence, Mudd worked tirelessly among the fever victims. He bled them (the standard treatment, though useless), administered quinine (also ineffective), and provided what comfort he could to the dying. He did not refuse or hesitate. By accounts from soldiers and officers who survived, Mudd's work was conscientious and selfless, motivated not by hope of pardon but by medical duty.</p>\n<p>The epidemic lasted through July and August. Bodies were buried in the sandy soil of Garden Key. The mortality rate was horrific—roughly 14 percent of the island's population—but it could have been worse. Some historians attribute the eventual containment of the outbreak, in part, to Mudd's medical intervention when no one else was capable of providing it. For related history, see our <a href=\"/articles/captain-tonys-saloon-key-west-haunted/\">captain tony's saloon: key west's most</a>.</p>\n\n<h2>Redemption Through Medical Service</h2>\n<p>Mudd's actions during the 1867 epidemic did not go unnoticed. Soldiers and officers who had been treated by him during the outbreak, including the commanding officer, formally petitioned President Andrew Johnson for Mudd's pardon. They attested to his dedication, his competence, and his role in preventing the epidemic from killing even more people.</p>\n<p>On February 8, 1869—nearly four years after his conviction on June 30, 1865 and imprisonment—President Andrew Johnson issued a full pardon of Dr. Samuel Mudd. Mudd left Fort Jefferson a free man. He returned to Maryland, resumed his medical practice, and lived until 1883, dying at age 49.</p>\n<p>The irony of his story is profound: he was imprisoned for alleged conspiracy in one death (Lincoln's assassination), and freed because he worked to prevent deaths during a yellow fever epidemic. His medical competence and moral courage, demonstrated under the worst conditions imaginable, secured his release when legal arguments and political appeals had failed.</p>\n\n<h2>The Submerged Cemetery: Rising Seas Reclaim the Dead</h2>\n<p>In August 2022, more than 155 years after the 1867 epidemic, divers from the University of Miami discovered the submerged remains of a 19th-century quarantine hospital and cemetery near the Dry Tortugas. The site was located on what had been a small island, now partially submerged by rising sea levels.</p>\n<p>Among the artifacts recovered was a headstone inscribed with the name and date: \"JOHN GREER. Nov. 5. 1861.\" The discovery confirmed historical suspicions that the official death toll from yellow fever and other diseases in the Keys was significantly understated. Many victims, particularly those who were poor or enslaved, were buried in unmarked graves or hasty mass burials on small islands that have since vanished or become submerged.</p>\n<p>The rising sea, driven by climate change and long-term sea-level rise, is literally reclaiming the buried dead. Skeletons and headstones that have rested on the ocean floor for over a century are being exposed and dispersed. This discovery has forced historians and archaeologists to revise upward their estimates of the death toll from tropical diseases in the 19th-century Keys. The submerged cemetery stands as a grim memorial to suffering that was incompletely recorded and for which many victims were forgotten.</p>\n\n<h2>Yellow Fever in Key West Proper</h2>\n<p>Fort Jefferson was not an isolated outbreak site. Key West itself was repeatedly devastated by yellow fever epidemics. The island recorded major outbreaks in 1853, 1862, and 1867—the same year as the catastrophic Fort Jefferson epidemic. Smaller outbreaks continued into the 1890s, until public health measures and insecticide campaigns began to control the Aedes aegypti population.</p>\n<p>Fort East Martello, on Key West's eastern end, served dual duty as both a military installation and a fever hospital where soldiers died from disease rather than combat. The <a href=\"/articles/fort-zachary-taylor-key-west-haunted/\">Fort Zachary Taylor garrison</a> also suffered casualties from yellow fever, as did virtually every military installation and civilian population center on the island. The <a href=\"/articles/key-west-cemetery-ghost-stories/\">Key West Cemetery</a> expanded at a furious pace during these decades—it now covers 19 acres and holds an estimated 100,000 burials, far more than the peak population could explain without the relentless toll of epidemic disease.</p>\n<p>The population of Key West had no defense except isolation, no treatment except those that did not work, and no explanation for why the disease struck when it struck. Yellow fever was a recurring apocalypse, visited upon the island with terrible randomness, claiming the young and old, the strong and weak, with no mercy and no understanding.</p>\n\n<h2>The Haunted Legacy of Fort Jefferson</h2>\n<p>Fort Jefferson today is accessible only by boat or seaplane, visited by tourists and history buffs, managed by the National Park Service as part of the Dry Tortugas National Park. The fort is peaceful in daylight, its massive walls standing silent. But the island's history of death and isolation imparts a particular character to the place. Park rangers and visitors have reported unexplained sounds in the fort's corridors—footsteps, voices, the echoes of a past that refuses to be silent.</p>\n<p>The submerged cemetery, the mass graves of the 1867 epidemic, the prisoners who died in confinement, the doctors who succumbed treating the sick—all remain on Garden Key and in the waters around it. Whether one believes in ghosts or not, the history of Fort Jefferson is haunted by the tens of thousands of lives interrupted by disease, by the incompleteness of the fort's mission, and by the isolation that made suffering on that island absolute and inescapable.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/key-west-cemetery-ghost-stories/\">Key West Cemetery: 100,000 Burials on 19 Acres</a></li>\n<li><a href=\"/articles/fort-east-martello-key-west-haunted/\">Fort East Martello: Key West's Haunted Civil War Fort</a></li>\n<li><a href=\"/articles/fort-zachary-taylor-key-west-haunted/\">Fort Zachary Taylor: Key West's Submerged History</a></li>\n<li><a href=\"/articles/most-haunted-places-in-key-west/\">Most Haunted Places in Key West</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n\n<li><a href=\"/articles/key-west-shipwrecks-wreckers-history/\">Key West Shipwrecks and the Wrecking Industry That Built Bone Island</a></li>\n</ul>",
  "excerpt": "Yellow fever killed 38 people at Fort Jefferson in 1867. In 2022, divers discovered submerged graves. The story of Dr.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "hub-spoke",
  "featuredImage": {
    "sourceUrl": "/images/articles/key-west-yellow-fever-fort-jefferson.webp",
    "altText": "Yellow Fever, Fort Jefferson, and the Dry Tortugas",
    "width": 800,
    "height": 450
  },
  "semanticScores": {
    "entities": 10,
    "years": 10,
    "dataPoints": 28,
    "namedPeople": 44,
    "sourceRefs": 1,
    "h2Breadth": 34,
    "entityDensity": 5.7
  },
  "articleType": "spoke"
}