{
  "title": "Most Haunted Places in Key West: From Robert the Doll to the Cemetery",
  "slug": "most-haunted-places-in-key-west",
  "id": 46104,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/most-haunted-places-in-key-west/",
  "date": "2026-02-16 12:00:00",
  "modified": "2026-02-16 12:00:00",
  "content": "<p>The Travel Channel named Key West one of America's most haunted cities. The island called Bone Island by Spanish explorers has accumulated centuries of death from shipwrecks, yellow fever, hurricanes, piracy, and war. Here are the places where that history is said to linger.</p>\n\n<p>This article is part of our <a href=\"/key-west-ghost-tours/\">comprehensive Key West ghost tours guide</a>.</p>\n\n<h2>Fort East Martello Museum</h2>\n<p>USA Today named Fort East Martello one of America's 10 Most Haunted Destinations. Built by the Union Army in 1862, the brick fort was never completed and never saw combat. Instead, it served as a staging area and hospital during the Civil War, where soldiers died from yellow fever, diphtheria, and other tropical diseases at rates that dwarfed battlefield casualties. The fort now houses Robert the Doll, Key West's most famous haunted artifact, and exhibits on the Carl von Cosel case. Staff report electronic malfunctions near Robert's display case, unexplained cold spots, and the sensation of being watched in the fort's corridors.</p>\n\n<h2>Captain Tony's Saloon</h2>\n<p>The building at 428 Greene Street has served as Key West's city morgue, a telegraph station, and the original Sloppy Joe's before becoming Captain Tony's. Seventeen people were hanged from the tree that now grows through the bar's roof. Bodies were discovered beneath the floorboards during 1980s renovations, and two grave markers remain visible inside. The Lady in Blue, hanged from the tree for murdering her family, is the most frequently reported apparition.</p>\n\n<h2>The Ernest Hemingway Home</h2>\n<p>Hemingway lived at 907 Whitehead Street from 1931 to 1939, writing some of his most celebrated works in the second-floor studio. Staff and visitors have reported seeing a figure resembling Hemingway sitting at his desk or standing at upper-floor windows. The sound of a typewriter has been heard from the empty studio. The home's famous polydactyl cats, descendants of Hemingway's original six-toed cat, seem unbothered by whatever else may inhabit the premises.</p>\n\n<h2>The Key West Cemetery</h2>\n<p>With an estimated 100,000 burials on 19 acres, the cemetery holds four times more dead than the island's living population. Relocated in 1847 after a hurricane washed coffins into the streets, it is dominated by above-ground vaults necessitated by the coral rock foundation. The Bahamian Guardian, a ghostly female figure, reportedly confronts visitors who disrespect the graves.</p>\n\n<h2>Marrero's Guest Mansion</h2>\n<p>Built in 1891 by cigar maker Francisco Marrero, this Victorian mansion is now a boutique hotel. The ghost of Enriquetta Marrero, Francisco's wife, is said to haunt the premises, particularly Room 18. When she left the home during her lifetime, Enriquetta reportedly told onlookers she would always be there in spirit. Guests have reported seeing her ghostly figure in hallways and hearing the sound of babies crying.</p>\n\n<h2>The Audubon House</h2>\n<p>Captain John Geiger, a prominent wrecker, built this house in the 1840s. His ghost has been seen on the balcony and walking through the tropical gardens, reportedly still guarding the fortune he is believed to have buried somewhere on the grounds. The house is now a museum dedicated to John James Audubon's visit to Key West in 1832.</p>\n\n<h2>Fort Zachary Taylor</h2>\n<p>Built with five-foot-thick walls and surrounded by a moat, Fort Zachary Taylor was active from the Civil War through the Cuban Missile Crisis in 1962. Park rangers and visitors report apparitions in Civil War-era uniforms, unexplained sounds, and cold spots in the fort's casemates. It is considered by locals to be the most haunted fort on the island.</p>\n\n<h2>St. Paul's Episcopal Church</h2>\n<p>The church has burned down twice: once when a distressed pastor allegedly set it aflame, and again in a citywide fire in 1886. The current structure sits atop what was once a graveyard, and the combination of violent destruction and disturbed burials has produced persistent reports of paranormal activity on the grounds.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/robert-the-doll-key-west-haunted-history/\">Robert the Doll: The True Story of Key West's Most Haunted Object</a></li>\n<li><a href=\"/articles/captain-tonys-saloon-key-west-haunted/\">Captain Tony's Saloon: Key West's Most Haunted Bar</a></li>\n<li><a href=\"/articles/key-west-cemetery-ghost-stories/\">Key West Cemetery: 100,000 Burials on 19 Acres</a></li>\n<li><a href=\"/key-west-ghost-tours/\">Key West Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "A guide to the most haunted locations in Key West, Florida—including Fort East Martello, Captain Tony's Saloon, the Hemingway House, and the Key West Cemetery.",
  "categories": [
    {
      "id": 610,
      "slug": "key-west-haunted-history",
      "name": "Key West Haunted History",
      "description": "Articles exploring Key West's haunted history from Robert the Doll and shipwreck legends to yellow fever cemeteries and Old Town hauntings on Bone Island."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "/images/articles/most-haunted-places-in-key-west.webp",
    "altText": "Most haunted places in Key West Florida ghost tours"
  }
}