{
  "title": "Salem Witch Trials Timeline: 1692 Day by Day",
  "slug": "salem-witch-trials-timeline",
  "id": 0,
  "status": "publish",
  "post_type": "article",
  "uri": "/articles/salem-witch-trials-timeline/",
  "date": "2026-02-24 12:00:00",
  "modified": "2026-02-24 12:00:00",
  "content": "<h2>How a Village Descended into Accusation Over Nine Months</h2><p>Between February 1692 and May 1693, the small Puritan village of Salem, Massachusetts experienced a cascade of witchcraft accusations that resulted in 19 executions, 5 deaths in custody, and one death by judicial torture. The crisis did not explode overnight. It unfolded across nine months in a precise, documented sequence of arrests, trials, and executions—each event amplifying the hysteria that preceded it. Understanding the timeline is essential to understanding how ordinary legal procedures, combined with community fear and institutional momentum, transformed a personal dispute into a community-wide catastrophe.</p><h2>The Afflictions Begin: January-February 1692</h2><p>The crisis began in the household of Reverend Samuel Parris, whose tenure in Salem Village had already become controversial. His predecessor, the moderate James Bayley, had been replaced by Parris in 1689—a transition that reflected deeper social divisions in the village between the prosperous Porter family merchants and the less-wealthy Putnam farmers. Parris's divisive theology and demands for greater compensation had deepened these rifts before the trials ever began.</p><p>In January 1692, Parris's 9-year-old daughter Betty Parris and his 11-year-old niece Abigail Williams began exhibiting disturbing symptoms: convulsions, contorted postures, and complaints of invisible pricking and pinching. A local physician, presumed to be William Griggs, examined them and declared their affliction supernatural—bewitchment—since no natural cause could be found. The diagnosis of witchcraft immediately shifted the problem from medical to spiritual and criminal.</p><p>By February, other young women in the village reported identical symptoms: Ann Putnam Jr. (12 years old), Elizabeth Hubbard, Mary Walcott, Mercy Lewis, Elizabeth Booth, and Mary Warren. The afflictions spread like contagion, suggesting either shared trauma, coordinated deception, or—as the village came to believe—a genuine supernatural attack. Each girl's outbreak reinforced the others' claims and validated the explanation that an invisible enemy had targeted the community's youth.</p><h2>First Arrests and Interrogations: February 29 and March 1, 1692</h2><p>On February 29, 1692, warrants were issued for three women: Sarah Good, Sarah Osborne, and Tituba. These were not random victims. Sarah Good was a homeless beggar, quarrelsome and poor, who lived wherever the community would tolerate her. Sarah Osborne was elderly, attended church infrequently, and had a reputation for difficult temperament. Tituba was an enslaved woman from Barbados in the household of Reverend Parris—a foreigner, a servant, and entirely without social protection.</p><p>On March 1, magistrates John Hathorne and Jonathan Corwin interrogated the three accused in the Salem Village meeting house. Tituba's response to their questions proved catastrophic. Rather than deny the charges, Tituba confessed to practicing witchcraft, describing meetings with the devil, seeing a tall man from Boston, and signing a devil's book. She claimed to have seen names written in the book and—critically—stated that other witches remained at large in the community, as yet unidentified.</p><p>This confession transformed the crisis from a local affliction into an active conspiracy. If Tituba spoke truth, then Salem harbored multiple witches who had not yet been arrested. If her confession was reliable, then the afflicted girls possessed genuine supernatural sensitivity and could identify other practitioners. The interrogation records were public knowledge, and Tituba's detailed narrative validated the girls' claims and legitimized further investigations.</p><h2>Spring 1692: Escalation and the Court Established</h2><p>Over the following weeks, additional arrests followed in rapid succession. Rebecca Nurse, a 71-year-old grandmother with large family connections, was arrested in March despite her protestations of innocence. Her arrest was shocking precisely because Rebecca Nurse was respected, church-attending, and socially integrated—evidence that the accusations were reaching beyond marginalized figures. Bridget Bishop, a tavern keeper with a contentious reputation, was also arrested and jailed.</p><p>By May, the crisis had grown so severe that colonial authorities could no longer ignore it. On May 27, Governor William Phips, newly arrived in Massachusetts, formally appointed a special court called the Court of Oyer and Terminer (meaning \"to hear and to determine\") to handle the backlog of witchcraft cases. The court was presided over by Chief Judge William Stoughton, a rigid Puritan whose interpretation of law favored spectral evidence—testimony that only the afflicted could see the invisible torture being inflicted on them by the accused witch.</p><p>The establishment of this specialized court professionalized the persecution. Accusations were no longer informal village disputes but formal legal proceedings with clear authority, documented evidence, and binding verdicts. The court's creation sent a signal that the colony took the witchcraft threat seriously enough to dedicate resources to prosecution.</p><h2>The First Execution: June 10, 1692</h2><p>On June 2, the Court of Oyer and Terminer convened in Salem Town. The first defendant tried was Bridget Bishop, the tavern keeper. The trial lasted a day. Witnesses testified that Bishop had caused harm to livestock and people. The afflicted girls performed dramatically in court, convulsing and crying out in apparent torment whenever Bishop looked at them. When Bishop's own words were used against her—she had made statements decades earlier that could be reinterpreted as hostile—the prosecution argued these revealed her guilt.</p><p>Bishop was convicted. On June 10, 1692, she was hanged at Proctor's Ledge (now believed to be an outcropping near what is now Gallows Hill in Salem). Her execution was the first of the trials, and it proved catastrophic to public perception. Once one execution had occurred, reversing course became politically and personally impossible for judges and magistrates. Acknowledging that Bridget Bishop was innocent would mean acknowledging that the court had killed an innocent person. The institutional momentum toward continued prosecutions was now locked in place.</p><h2>Summer 1692: Mass Trials and Executions</h2><p>The trials accelerated through June, July, and August with a mechanistic efficiency. The court's procedures were routinized: afflicted girls performed in court, witnesses testified to prior harm, the accused maintained innocence or confessed, the jury convicted, the judge sentenced. Appeals and reprieves were rare. The cases moved through the system like victims through a machinery specifically designed to produce guilty verdicts.</p><p>On June 29-30, five defendants—Susannah Martin, Rebecca Nurse, Sarah Good, Elizabeth Howe, and Sarah Wildes—were tried. All were convicted. On July 19, 1692, all five were hanged at Proctor's Ledge. The execution of Rebecca Nurse was particularly significant because her conviction had sparked family protest and community controversy. Despite her family's petitions and her own powerful protestations of innocence, the court's verdict stood. Her execution demonstrated that social status and family support could not protect the accused once the legal system had moved against them.</p><p>On August 19, 1692, five more people were executed: John Proctor, George Jacobs Sr., George Burroughs, Martha Carrier, and John Willard. Proctor was a tavern keeper who had criticized the trials themselves, making him a target for the accusers. Burroughs was a former minister, and his prosecution and execution suggested that even clergy were not immune. Martha Carrier had had conflicts with her neighbors years before, grievances that were now reframed as evidence of witchcraft. The trials were consuming the village's accumulated conflicts and converting them into capital crimes.</p><h2>The Crisis Deepens: Giles Corey and September Executions</h2><p>In September 1692, the trials reached a turning point when Giles Corey, an 80-year-old farmer, refused to enter a plea. Under English common law, a defendant who refused to plead could not be tried—which meant he could not be convicted and executed. Corey apparently understood that by refusing to plead, he could preserve his estate for his heirs. Under a 1692 statute, if a defendant refused to plead, the court could order him pressed with stones until he either entered a plea or died.</p><p>On September 17, Corey was taken to a field near the Salem jail and subjected to \"pressing\"—gradually increasing weight placed upon his body. For two days, stones were added to the press as magistrates asked him repeatedly to enter a plea. Corey refused. When asked his plea, he responded only: \"More weight.\" He died under the stones on September 17, 1692—the only person in American history to be judicially pressed to death. His refusal to plead became a powerful symbol of resistance to the court's authority.</p><p>On September 22, 1692, the final execution day of the trials saw eight people hanged: Martha Corey, Margaret Scott, Mary Easty, Alice Parker, Ann Pudeator, Wilmott Redd, Samuel Wardwell, and Mary Parker. This was the largest single execution day. The trials had now consumed five months and claimed 19 lives. The machinery of conviction had achieved a steady-state operation. Without external intervention, there was no mechanism within the legal system to halt the prosecutions.</p><h2>Turning Point: October 1692 and Governor Phips's Intervention</h2><p>By October 1692, public opinion had shifted. The <a href=\"/articles/the-salem-witch-trials-causes-consequences-and-lasting-legacy/\">causes and consequences of the trials</a> were becoming visible as more prominent citizens were accused, including the wife of Governor William Phips himself. When accusations reached the elite, the credibility of the entire prosecution system came into question.</p><p>On October 29, 1692, Governor Phips issued a proclamation prohibiting further arrests for witchcraft and dissolving the Court of Oyer and Terminer. The special court that had produced all 19 executions simply ceased to exist. No new trials could be initiated under its authority. This was not a judicial decision—judges did not reverse their own verdicts. It was a political intervention by the executive, which overrode the legal system that had been operating autonomously.</p><p>Phips issued reprieves for five people scheduled for execution, including Lady Phips herself (though her case never reached trial). Remaining accused witches remained in custody but were no longer being tried or convicted.</p><h2>Aftermath and Resolution: 1693</h2><p>In January 1693, remaining witchcraft cases were transferred to the regular Superior Court of Judicature, which operated under different evidentiary rules. Spectral evidence—testimony about invisible torment—was no longer admissible as proof of guilt. Without the testimony of the afflicted girls about supernatural assault, prosecutors had little evidence. Nearly all remaining cases resulted in acquittals.</p><p>On May 3, 1693, Governor Phips issued general pardons to all remaining accused, conditionally releasing them from custody. The legal persecution had formally ended. The trials, which had claimed 19 lives through hanging, resulted in 5 additional deaths in custody, and one death by pressing, were over. More than <a href=\"/articles/who-were-the-accused-witches-of-salem/\">150 people had been accused</a>, but the legal system had been stopped before the persecution could continue.</p><h2>Long-Term Reckoning: 1697-1711</h2><p>Formal acknowledgment of error came slowly. In 1697, the Massachusetts General Court declared a day of fasting and repentance for the errors of the trials. Judge Samuel Sewall, who had served on the jury, publicly confessed his guilt in church and asked forgiveness. Twelve jurors signed a statement claiming they had been \"deluded by Satan\" into condemning innocent people.</p><p>In 1711, the Massachusetts legislature reversed the attainders (legal convictions) against many of the accused and appropriated funds for compensation to affected families. However, <a href=\"/articles/how-the-salem-witch-trials-ended-and-why/\">not all victims were included in the initial exoneration</a>. It took until 2001—309 years after the trials—for the remaining eight victims to receive official exoneration. Martha Corey, Giles Corey, Mary Easty, Alice Parker, Mary Parker, John Proctor, Ann Foster, and Rebecca Nurse were formally exonerated in 2001 by the Massachusetts legislature.</p><h2>What the Timeline Reveals</h2><p>The chronology of the Salem witch trials demonstrates that the persecution was not random or spontaneous. It followed a documented sequence from initial affliction through arrests, trials, convictions, executions, and finally intervention. Each step was procedurally legal under contemporary law. Each verdict was rendered by judges and juries acting within their authority. The entire system was not corrupt—it was functioning.</p><p>The crisis ended not because the legal system reformed itself but because external political authority intervened to change the rules. Governor Phips and ministerial authorities like Cotton Mather reconsidered the evidentiary standards that the court had accepted. <a href=\"/articles/the-role-of-children-in-the-salem-witch-trials/\">The role of children as accusers</a> was eventually recognized as problematic. But these changes required someone with power to impose them against the inertia of an operating legal system.</p><p>Understanding the timeline is understanding why Salem matters: it reveals how ordinary institutions, functioning according to their own logic, can produce catastrophic injustice. The solution was not moral awakening within the system but political intervention from outside it. This remains the most difficult lesson Salem offers to those who study it.</p><hr /><h3>Continue Reading</h3><ul><li><a href=\"/blog/salem-witch-trials/\">Explore the Salem Witch Trials Hub</a></li><li><a href=\"/articles/the-salem-witch-trials-causes-consequences-and-lasting-legacy/\">The Salem Witch Trials: Causes, Consequences, and Lasting Legacy</a></li><li><a href=\"/articles/who-were-the-accused-witches-of-salem/\">Who Were the Accused Witches of Salem?</a></li><li><a href=\"/articles/how-the-salem-witch-trials-ended-and-why/\">How the Salem Witch Trials Ended (and Why)</a></li><li><a href=\"/articles/the-role-of-children-in-the-salem-witch-trials/\">The Role of Children in the Salem Witch Trials</a></li></ul>",
  "excerpt": "Between February 1692 and May 1693, Salem descended into witchcraft accusations that resulted in 19 executions.",
  "categories": [
    {
      "id": 583,
      "slug": "salem-witch-trials",
      "name": "Salem Witch Trials",
      "description": "In-depth articles exploring the history, causes, trials, and lasting legacy of the Salem Witch Trials of 1692, examining how fear, law, and belief combined to shape one of the most infamous events in American history."
    }
  ],
  "pageType": "hub-spoke",
  "featuredImage": {
    "sourceUrl": "/images/articles/salem-witch-trials-timeline.webp",
    "altText": "Timeline of the Salem witch trials from 1692 showing key dates and executions",
    "width": 800,
    "height": 450
  },
  "wordCount": 2187,
  "readingTime": "8 min read",
  "articleType": "spoke"
}
