{
  "title": "Famous Prisoners of the Tower of London",
  "slug": "tower-of-london-famous-prisoners",
  "id": 63173,
  "status": "publish",
  "post_type": "article",
  "uri": "/articles/tower-of-london-famous-prisoners/",
  "date": "2026-02-15 23:51:34",
  "modified": "2026-02-15 23:51:34",
  "content": "<h2>Nine Centuries of Captivity</h2>\n<p>The Tower of London has held prisoners since 1100, when Ranulf Flambard, Bishop of Durham, became the first recorded inmate. He was also the first to escape — climbing down a rope smuggled inside a wine cask and fleeing to Normandy. Over the following 850 years, the Tower imprisoned kings and queens, bishops and saints, spies and traitors, foreign monarchs and domestic rebels. The last prisoner, Rudolf Hess, left in 1941. The last prisoners held at the Tower in any capacity were the Kray twins in 1952, detained for failing to report for national service.</p>\n<p>The Tower was never primarily a prison. It served simultaneously as a royal palace, an armory, a treasury, a mint, a records office, a menagerie, and the home of the Crown Jewels. Imprisonment there carried a specific political charge — it meant the Crown considered you important enough to keep under personal supervision. Common criminals went to Newgate or the Marshalsea. The Tower was reserved for those whose existence posed a direct threat to the monarchy.</p>\n<p>Conditions varied enormously depending on the prisoner's status and the monarch's disposition. Some prisoners lived in relative comfort, dining with their guards, receiving visitors, and maintaining correspondence. Others endured the Tower's dungeons — underground cells where standing upright was impossible and rats outnumbered humans. The Tower contained both luxury apartments and torture chambers, and a prisoner might experience both during a single stay.</p>\n\n<h2>Sir Thomas More</h2>\n<p>Thomas More, Lord Chancellor of England, entered the Tower on April 17, 1534, for refusing to acknowledge Henry VIII as Supreme Head of the Church of England. His imprisonment lasted 15 months. During that time, he wrote A Dialogue of Comfort Against Tribulation, conducted extensive correspondence with his daughter Margaret Roper, and maintained a composure that impressed even his jailers. His cell in the Bell Tower was relatively comfortable — he had a servant, books, and writing materials.</p>\n<p>More's trial in Westminster Hall on July 1, 1535, lasted a single day. The verdict was predetermined. He was convicted of treason on the perjured testimony of Richard Rich, the Solicitor General, who claimed More had denied the king's supremacy in a private conversation. More famously told the court that he trusted he and his judges would \"merrily meet in heaven.\" He was beheaded on Tower Hill on July 6, making a joke on the scaffold about the weakness of his neck. The Catholic Church canonized him in 1935.</p>\n\n<h2>Sir Walter Raleigh</h2>\n<p>Walter Raleigh spent a combined 13 years in the Tower across two imprisonments, making him one of its longest-serving and most comfortable inmates. His first stay in 1592 — punishment for secretly marrying one of Elizabeth I's ladies-in-waiting — lasted a few weeks. His second, from 1603 to 1616, was essentially a life sentence imposed by James I on charges of conspiring with Spain. The charges were almost certainly baseless, motivated by James's desire to appease the Spanish ambassador.</p>\n<p>Raleigh transformed his imprisonment into a productive intellectual exile. He occupied rooms in the Bloody Tower with his wife Bess and their son Carew, who was conceived and born during the imprisonment. He maintained a small laboratory where he distilled medicines, grew tobacco and herbs in a garden on the Tower walls, and conducted chemical experiments. His major literary work, The History of the World, was written during this period — an ambitious attempt to chronicle human history from Creation to the second century BCE that ran to over a million words before he abandoned it.</p>\n<p>James released Raleigh in 1616 to lead an expedition to Guiana in search of gold. The expedition failed, Raleigh's men attacked a Spanish settlement in violation of explicit orders, and his son Wat was killed in the fighting. James, under pressure from the Spanish ambassador, reactivated the original death sentence. Raleigh was executed at the Palace of Westminster on October 29, 1618. He reportedly felt the axe blade and told the executioner: \"This is a sharp medicine, but it is a physician for all diseases and miseries.\"</p>\n\n<h2>The Tudor Queens</h2>\n<p><a href=\"/articles/anne-boleyn-execution-tower/\">Anne Boleyn entered the Tower on May 2, 1536</a>, through the same watergate — later called Traitors' Gate — through which she had passed in triumph for her coronation three years earlier. She was charged with adultery, incest with her brother George, and plotting the king's death. The charges were fabricated by Thomas Cromwell to clear the way for Henry VIII's marriage to Jane Seymour. Anne spent 17 days in the Tower before her execution on May 19.</p>\n<p>Catherine Howard, Henry's fifth wife, followed the same path six years later. Arrested for adultery in November 1541, she was held at Syon House before transfer to the Tower in February 1542. Legend holds that she requested the execution block be brought to her cell the night before so she could practice placing her head correctly. She was beheaded on Tower Green on February 13, 1542, at approximately 20 years of age.</p>\n<p>Lady Jane Grey, the \"Nine Days' Queen,\" was imprisoned in the Tower after the failure of the plot to place her on the throne in July 1553. She lived in relative comfort in the Gentleman Gaoler's house for seven months, during which her father's participation in Wyatt's Rebellion sealed her fate. She was executed on Tower Green on February 12, 1554, at age 16 or 17. Her composure on the scaffold — she forgave the executioner, blindfolded herself, and groped for the block saying \"What shall I do? Where is it?\" — became one of the Tower's most retold stories.</p>\n\n<h2>Rudolf Hess and the Modern Era</h2>\n<p>The Tower's last high-profile prisoner arrived under the most bizarre circumstances in its history. Rudolf Hess, Hitler's deputy, flew a Messerschmitt Bf 110 solo from Augsburg to Scotland on May 10, 1941, bailing out over Renfrewshire with the apparent intention of negotiating peace with the Duke of Hamilton. He was captured by a farmer armed with a pitchfork, initially gave a false name, and was eventually identified and transferred to the Tower.</p>\n<p>Hess spent four days in the Tower — held in rooms in the King's House that were considerably more comfortable than his accommodations in various military hospitals and prisons that followed. He was the last state prisoner held within the Tower walls, though the Kray twins' brief detention in 1952 is sometimes cited as the Tower's final act of imprisonment. The Tower Guard maintained 24-hour watch on Hess, and his presence was kept secret from the public until after his transfer.</p>\n<p>The Tower transitioned from an active prison to a heritage site gradually over the 19th and 20th centuries. The moat was drained in 1843. The menagerie closed in 1835 when its animals were transferred to the new London Zoo. Tourism began informally in the Tudor period and was formalized in the 19th century. Today, approximately three million visitors annually walk the same grounds where prisoners were held, tortured, and executed — a transformation from place of power to place of memory that the Tower's earliest prisoners could not have imagined.</p>\n<hr /><h3>Continue Reading</h3>\n<ul><li><a href=\"/blog/tower-of-london/\">Explore the Tower of London Hub</a></li>\n<li><a href=\"/articles/anne-boleyn-execution-tower/\">Anne Boleyn's Execution at the Tower</a></li>\n<li><a href=\"/articles/princes-in-the-tower-mystery/\">The Princes in the Tower Mystery</a></li>\n<li><a href=\"/articles/tower-of-london-ravens-legend/\">The Ravens of the Tower of London: Legend, History, and Superstition</a></li>\n</ul>",
  "excerpt": "The Tower of London has held prisoners since 1100, when Ranulf Flambard, Bishop of Durham, became the first recorded inmate — and the first to escape,...",
  "categories": [
    {
      "id": 702,
      "slug": "tower-of-london-history",
      "name": "Tower of London History",
      "description": "Executions, prisoners, the Crown Jewels, and nearly 1,000 years of royal terror."
    }
  ],
  "pageType": "hub-spoke",
  "featuredImage": {
    "sourceUrl": "/images/articles/tower-of-london-famous-prisoners.webp",
    "altText": "Famous Prisoners of the Tower of London",
    "width": 800,
    "height": 450
  },
  "wordCount": 1200,
  "readingTime": "4 min read",
  "articleType": "spoke"
}
