{
  "title": "The Ravens of the Tower of London",
  "slug": "tower-of-london-ravens-legend",
  "id": 80870,
  "status": "publish",
  "post_type": "article",
  "uri": "/articles/tower-of-london-ravens-legend/",
  "date": "2026-02-15 23:51:34",
  "modified": "2026-02-25 21:29:22",
  "content": "<h2>The Prophecy That May Not Exist</h2>\n<p>The most famous piece of Tower of London folklore holds that if the ravens ever leave, the kingdom will fall. The prophecy is attributed to Charles II, who supposedly ordered the birds' protection after his Royal Astronomer John Flamsteed complained that they interfered with telescope observations from the White Tower. It is a satisfying story — the pragmatic king choosing superstition over science. The problem is that no contemporary document records Charles making any such decree, and the earliest written reference to the prophecy dates to the late 19th century.</p>\n<p>Historians Boria Sax and Geoff Parnell have traced the raven legend through Tower records and found no mention of ravens as a significant presence before the Victorian era. The Tower menagerie — which housed lions, elephants, and other exotic animals from the 13th century until 1835 — never recorded ravens among its inhabitants. The birds were almost certainly present as scavengers attracted to the Tower's waste and the remains of executed prisoners, but their elevation from urban pests to symbols of national destiny appears to be a relatively modern invention.</p>\n<p>The legend likely crystallized during the late Victorian period, when the Tower was being reimagined as a heritage site rather than a functioning military installation. The Victorians were prolific myth-makers, and the raven prophecy fit perfectly into their project of wrapping British institutions in layers of ancient tradition. Whether the legend was invented from whole cloth or assembled from fragments of older, undocumented folk belief is a question the historical record cannot answer definitively.</p>\n\n<h2>The Ravenmaster</h2>\n<p>Regardless of the legend's origins, the ravens are now central to the Tower's identity, and their care has been formalized into one of the most unusual job descriptions in the British government. The Ravenmaster is a Yeoman Warder — a member of the ceremonial guard drawn from retired military personnel with at least 22 years of service — who is assigned primary responsibility for the birds. The position is not a sinecure. The Ravenmaster rises before dawn, prepares daily meals of raw meat and blood-soaked biscuits, monitors each bird's health and behavior, and manages the complex social dynamics of a group of large, intelligent, territorial corvids.</p>\n<p>Christopher Skaife, who served as Ravenmaster from 2011 to recent years, published a memoir titled The Ravenmaster that provided the most detailed public account of the role. Skaife described the birds as individually distinct personalities requiring individual management strategies. Some ravens responded to vocal commands. Others ignored instructions entirely. One bird, Munin, would follow Skaife across the Tower grounds like a dog. Another, Erin, bit every visitor who approached her. The Ravenmaster's job combined animal husbandry, behavioral psychology, and crowd management in proportions that no job description could adequately capture. For related history, see our <a href=\"/articles/anne-boleyn-execution-tower/\">anne boleyn's execution at the tower</a>.</p>\n<p>The birds are technically free to leave — their flight feathers are trimmed to limit range, but the trimming is light enough to allow short flights within the Tower walls. The distinction between \"cannot leave\" and \"choose not to leave\" matters to the mythology. A captive raven cannot fulfill the prophecy's conditions. A raven that stays by choice sustains the legend's power. The trimming is a pragmatic compromise between superstition and ornithology.</p>\n\n<h2>Raven Intelligence and Behavior</h2>\n<p>Ravens are among the most intelligent birds on Earth, with cognitive abilities comparable to great apes in several tested domains. They use tools, plan for future events, engage in play, and demonstrate what researchers interpret as theory of mind — the ability to understand that other beings have thoughts and intentions different from their own. Tower ravens display behaviors consistent with this research, solving problems, manipulating visitors, and engaging in complex social interactions that reflect genuine individual intelligence rather than instinctive patterns.</p>\n<p>The birds can mimic human speech with clarity rivaling parrots. Tower ravens have been documented saying \"hello,\" \"good morning,\" and, in one case, reportedly imitating the Ravenmaster's mobile phone ringtone. They recognize individual human faces and modify their behavior accordingly — approaching people who have given them treats and avoiding those who have annoyed them. Visitors who ignore the \"do not feed the ravens\" signs may find themselves rewarded with a corvid companion for the duration of their visit. Visitors who attempt to touch the birds may find themselves minus a finger's worth of skin.</p>\n<p>Tower ravens live significantly longer than their wild counterparts. Wild ravens typically survive 10 to 15 years; Tower ravens, benefiting from regular feeding, veterinary care, and protection from predators, have lived past 40. This longevity creates a problem of emotional attachment — the Ravenmaster and other Tower staff develop relationships with individual birds that span decades, and the death of a long-resident raven is mourned as a genuine loss by the community. For related history, see our <a href=\"/articles/princes-in-the-tower-mystery/\">the princes in the tower: england's</a>.</p>\n\n<h2>Merlina and the COVID Crisis</h2>\n<p>The most famous Tower raven of the 21st century was Merlina, a female who arrived at the Tower in 2007 and quickly established herself as the flock's dominant personality. Merlina was antisocial by raven standards — she preferred solitude, avoided other ravens, and formed an unlikely attachment to a wild fox that had colonized the Tower moat. She would leave food scraps for the fox and was observed sitting near it in apparent companionship. The Ravenmaster described her as the most intelligent bird he had ever worked with.</p>\n<p>Merlina disappeared in late December 2020, during the COVID lockdown that had closed the Tower to visitors for months. She was declared missing in January 2021, and the Tower confirmed she was presumed dead. Her loss reduced the raven population to seven — one above the traditional minimum of six birds maintained as insurance against the prophecy. The timing was not lost on a public already deep in pandemic anxiety. Social media commentary about the raven prophecy and the fall of the kingdom was extensive, ranging from genuinely superstitious to darkly humorous.</p>\n<p>The incident demonstrated how deeply the raven legend has embedded itself in British national consciousness, regardless of its historical authenticity. A missing bird at a tourist attraction became an international news story because the mythology surrounding the Tower's ravens taps into something older and more persistent than the legend itself — the human desire to find meaning in the behavior of animals, and the specifically British attachment to institutions that blur the line between heritage and superstition.</p>\n\n<h2>Visiting the Ravens</h2>\n<p>The Tower maintains a minimum of six ravens at all times, with the current population typically numbering seven or eight. The birds roam the Tower Green and the inner ward, where they are accessible to visitors though not approachable. Signs warn against feeding or touching them, advice that the ravens themselves enforce through strategic pecking and intimidation. The Ravenmaster delivers informal talks about the birds during the day, and Yeoman Warder tours include raven-related stops and anecdotes.</p>\n<p>The best viewing times are morning and late afternoon, when the ravens are most active. They roost in dedicated enclosures near the Wakefield Tower at night and are released into the grounds after dawn. Their favorite perching spots — the Tower Green, the area near the Beauchamp Tower, and the railings along the inner ward — are consistent enough that regular visitors learn where to find specific birds. The ravens are, in effect, the Tower's most charismatic residents, more photographed than the Crown Jewels and more discussed than <a href=\"/articles/tower-of-london-famous-prisoners/\">any of its famous prisoners</a>.</p>\n<hr /><h3>Continue Reading</h3>\n<ul><li><a href=\"/blog/tower-of-london/\">Explore the Tower of London Hub</a></li>\n<li><a href=\"/articles/princes-in-the-tower-mystery/\">The Princes in the Tower Mystery</a></li>\n<li><a href=\"/articles/tower-of-london-famous-prisoners/\">Famous Prisoners of the Tower</a></li></ul>",
  "excerpt": "The most famous piece of Tower of London folklore holds that if the ravens ever leave, the kingdom will fall.",
  "categories": [
    {
      "id": 702,
      "slug": "tower-of-london-history",
      "name": "Tower of London History",
      "description": "Executions, prisoners, the Crown Jewels, and nearly 1,000 years of royal terror."
    }
  ],
  "pageType": "hub-spoke",
  "featuredImage": {
    "sourceUrl": "/images/articles/tower-of-london-ravens-legend.webp",
    "altText": "The Ravens of the Tower of London: Legend, History, and Superstition",
    "width": 800,
    "height": 450
  },
  "wordCount": 1262,
  "readingTime": "5 min read",
  "articleType": "spoke",
  "semanticScores": {
    "entities": 5,
    "years": 5,
    "dataPoints": 9,
    "namedPeople": 17,
    "sourceRefs": 1,
    "h2Breadth": 11,
    "entityDensity": 4.0
  }
}